{
  "title": "ECB Won’t Flinch Yet in the Shadow of Trump’s Trade War",
  "link": "https://finance.yahoo.com/news/ecb-won-t-flinch-yet-200000931.html",
  "published": "2025-07-20T16:43:29Z",
  "body": "ECB Won’t Flinch Yet in the Shadow of Trump’s Trade War\nOops, something went wrong\nNews\nToday's news\nUS\nPolitics\nWorld\nTech\nAudio\nComputing\nGaming\nWordle\nHome entertainment\nTVs\nPhones\nScience\nStreaming\nStreaming reviews\nVPN\nWearables\nDeals\nPrime Day 2025\nBest Amazon Prime Day deals\nMore\nAI\nApps\nAR and VR\nBusiness\nCameras\nCyber security\nEntertainment\nGeneral\nSmart home\nSocial media\nTransportation\nWeather\nClimate change\nHealth\nWellness\nMental health\nSexual health\nDermatology\nOral health\nHair loss\nFoot health\nNutrition\nHealthy eating\nMeal delivery\nWeight loss\nVitamins and supplements\nFitness\nEquipment\nExercise\nWomen’s health\nSleep\nHealthy aging\nHearing\nMobility\nScience\nOriginals\nThe 360\nNewsletters\nGames\nLife\nHealth\nWellness\nMental health\nSexual health\nDermatology\nOral health\nHair loss\nFoot health\nNutrition\nHealthy eating\nMeal delivery\nWeight loss\nVitamins and supplements\nFitness\nEquipment\nExercise\nWomen’s health\nSleep\nHealthy aging\nHearing\nMobility\nParenting\nFamily health\nSo mini ways\nStyle and beauty\nIt Figures\nUnapologetically\nHoroscopes\nShopping\nStyle\nAccessories\nClothing\nLuggage\nShoes\nBeauty\nHair\nMakeup\nSkincare\nSunscreen\nHealth\nDental\nFitness\nHair loss\nHearing aids\nMental health\nMobility\nNutrition\nPersonal care\nSleep\nWomen's health\nHome & Garden\nBedding\nCleaning\nGardening\nKitchen\nOutdoor\nPets\nTech\nAccessories\nAudio\nAuto\nComputers\nPhones\nSmart home\nTVs\nGift ideas\nStores\nAmazon\nBest Buy\nHome Depot\nMacy's\nNordstrom\nTarget\nWalmart\nWayfair\nShopping Guides\nBest non-toxic cutting boards\nBest heated socks\nBest body wash\nBest cordless stick vacuums\nBest makeup removers\nDeals\nFather’s Day gifts\nBest Father’s Day gifts\nBest Father’s Day gifts under $50\nPrime Day 2025\nBest Amazon Prime Day deals\nFood\nTravel\nAutos\nGift ideas\nBuying guides\nEntertainment\nCelebrity\nTV\nMovies\nMusic\nHow to Watch\nInterviews\nVideos\nFinance\nMy Portfolio\nNews\nLatest\nStock Market\nOriginals\nTariff Updates\nNewsletters\nEconomies\nPremium News\nEarnings\nTech\nHousing\nCrypto\nMergers & IPOs\nElectric Vehicles\nInflation\nMarkets\nStocks: Most Actives\nStocks: Gainers\nStocks: Losers\nTrending Tickers\nFutures\nWorld Indices\nUS Treasury Bonds Rates\nCurrencies\nCrypto\nTop ETFs\nTop Mutual Funds\nOptions: Highest Open Interest\nOptions: Highest Implied Volatility\nSectors\nBasic Materials\nCommunication Services\nConsumer Cyclical\nConsumer Defensive\nEnergy\nFinancial Services\nHealthcare\nIndustrials\nReal Estate\nTechnology\nUtilities\nPrivate Companies\nResearch\nScreeners\nEarnings Calendar\nEconomic Calendar\nStock Comparison\nAdvanced Chart\nCurrency Converter\nStock Picks\nInvestment Ideas\nResearch Reports\nPersonal Finance\nCredit Cards\nBanking\nStudent Loans\nPersonal Loans\nInsurance\nMortgages\nMortgage Calculator\nTaxes\nVideos\nLatest\nTrending Stocks\nMarket Sunrise\nMorning Brief\nOpening Bid\nAll Shows\nEditor's Picks\nStocks in Translation\nTrader Talk\nFinancial Freestyle\nETF Report\nWatch Now\nSports\nFantasy\nNews\nFantasy football\nBest ball\nPro Pick 'Em\nCollege Pick 'Em\nFantasy baseball\nFantasy hockey\nFantasy basketball\nDownload the app\nDaily fantasy\nNFL\nNews\nScores and schedules\nStandings\nStats\nTeams\nPlayers\nDrafts\nInjuries\nOdds\nSuper Bowl\nGameChannel\nVideos\nNBA\nNews\nDraft\nScores and schedules\nStandings\nStats\nTeams\nPlayers\nInuries\nVideos\nOdds\nPlayoffs\nMLB\nNews\nScores and schedules\nStandings\nStats\nTeams\nPlayers\nOdds\nVideos\nWorld Baseball Classic\nNHL\nNews\nScores and schedules\nStandings\nStats\nTeams\nPlayers\nOdds\nPlayoffs\nCollege football\nNews\nScores and schedules\nStandings\nRankings\nStats\nTeams\nCollege basketball\nSoccer\nNews\nScores and schedules\nPremier League\nMLS\nNWSL\nLiga MX\nCONCACAF League\nChampions League\nLa Liga\nSerie A\nBundesliga\nLigue 1\nWorld Cup\nNFL Draft\nYahoo Sports AM\nShow all\nWNBA\nSportsbook\nNCAAF\nTennis\nGolf\nNASCAR\nNCAAB\nNCAAW\nBoxing\nUSFL\nCycling\nMotorsports\nOlympics\nHorse racing\nGameChannel\nRivals\nNewsletters\nPodcasts\nVideos\nRSS\nJobs\nHelp\nWorld Cup\nMore news\nNew on Yahoo\nCreators\nTech\nLocal services\nTerms\nPrivacy\nYour Privacy Choices\nCA Privacy Notice\nFeedback\n© 2025\nAll rights reserved.\nAbout our ads\nAdvertising\nCareers\nYahoo Finance\nYahoo Finance\nSearch query\nSelect edition\nUS\nEnglish\nUS y LATAM\nEspañol\nAustralia\nEnglish\nCanada\nEnglish\nCanada\nFrançais\nDeutschland\nDeutsch\nFrance\nFrançais\n香港\n繁中\nMalaysia\nEnglish\nNew Zealand\nEnglish\nSingapore\nEnglish\n台灣\n繁中\nUK\nEnglish\nNews\nFinance\nSports\nMore\nNews\nToday's news\nUS\nPolitics\nWorld\nWeather\nClimate change\nHealth\nScience\nOriginals\nNewsletters\nGames\nLife\nHealth\nParenting\nStyle and beauty\nHoroscopes\nShopping\nFood\nTravel\nAutos\nGift ideas\nBuying guides\nEntertainment\nCelebrity\nTV\nMovies\nMusic\nHow to Watch\nInterviews\nVideos\nFinance\nMy portfolio\nWatchlists\nMarkets\nNews\nVideos\nScreeners\nPersonal finance\nCrypto\nSectors\nSports\nFantasy\nNFL\nNBA\nMLB\nNHL\nCollege football\nCollege basketball\nSoccer\nNFL Draft\nYahoo Sports AM\nNew on Yahoo\nCreators\nTech\nLocal services\nSelected edition\nUS\nEnglish\nMail\nSign in\nMy Portfolio\nNews\nLatest\nStock Market\nOriginals\nTariff Updates\nNewsletters\nEconomies\nPremium News\nEarnings\nTech\nHousing\nCrypto\nMergers & IPOs\nElectric Vehicles\nInflation\nMarkets\nStocks: Most Actives\nStocks: Gainers\nStocks: Losers\nTrending Tickers\nFutures\nWorld Indices\nUS Treasury Bonds Rates\nCurrencies\nCrypto\nTop ETFs\nTop Mutual Funds\nOptions: Highest Open Interest\nOptions: Highest Implied Volatility\nSectors\nBasic Materials\nCommunication Services\nConsumer Cyclical\nConsumer Defensive\nEnergy\nFinancial Services\nHealthcare\nIndustrials\nReal Estate\nTechnology\nUtilities\nPrivate Companies\nResearch\nScreeners\nEarnings Calendar\nEconomic Calendar\nStock Comparison\nAdvanced Chart\nCurrency Converter\nStock Picks\nInvestment Ideas\nResearch Reports\nPersonal Finance\nCredit Cards\nBanking\nStudent Loans\nPersonal Loans\nInsurance\nMortgages\nMortgage Calculator\nTaxes\nVideos\nLatest\nTrending Stocks\nMarket Sunrise\nMorning Brief\nOpening Bid\nAll Shows\nEditor's Picks\nStocks in Translation\nTrader Talk\nFinancial Freestyle\nETF Report\nWatch Now\n…\nUpgrade to Premium\nECB Won’t Flinch Yet in the Shadow of Trump’s Trade War\nCraig Stirling\nSun, Jul 20, 2025, 9:43 AM\n9 min read\nIn This Article:\nMS\nMS-PQ\n3988.HK\nEUR=X\nEURUSD=X\n(Bloomberg) -- The European Central Bank is likely to stare down the economic danger posed by US President Donald Trump’s tariffs by opting to leave a potential cut in borrowing costs for another day.\nMost Read from Bloomberg\nWhy the Federal Reserve’s Building Renovation Costs $2.5 Billion\nMilan Corruption Probe Casts Shadow Over Property Boom\nMumbai Facelift Is Inspired by 200-Year-Old New York Blueprint\nHow San Jose’s Mayor Is Working to Build an AI Capital\nIn their final decision before a seven-week summer break, policymakers on Thursday will probably keep the interest rate unchanged at 2%, pushing off a response to Trump’s threatened tariffs of 30% until they materialize and their impact can be better assessed.\nWith many officials likely to use the interlude for a long holiday, the temptation to restate that inflation is at target, and to postpone worrying about the economic outlook until new quarterly forecasts are compiled for the Sept. 10-11 meeting, may seem appropriate.\nWhat policymakers do know, however, is that trouble is lurking. Aside from concerns about tariffs, the euro has strengthened, damping the outlook for prices and threatening to further squeeze exporters. Meanwhile, another political crisis in France may be brewing over its bloated public finances.\nGiven that backdrop, the ECB Governing Council could acknowledge among themselves that the chance of another rate cut in September is growing, even if they stick with their well-worn “meeting-by-meeting” approach to decision making.\nIn that vein, President Christine Lagarde, in her opening statement to reporters on Thursday, is likely to restate that risks to growth are “tilted to the downside,” Morgan Stanley economists wrote in a preview titled “Ready for the Beach.”\nWhat Bloomberg Economics Says:\n“We expect the Governing Council’s language after the July 24 meeting to be similar to the wording in June, leaving open the possibility of additional cuts without committing to them.”\n—David Powell, senior euro-area economist. For full analysis, click here\nEconomic reports in the coming week will inform their deliberations. They include the ECB’s own bank lending survey, due on Tuesday, consumer confidence on Wednesday, and purchasing manager indexes from across the region and other major economies, set for release on Thursday, hours before the outcome of the ECB deliberations.\nOther key indicators such as Germany’s closely-watched Ifo business confidence and Italian economic sentiment will follow on Friday.\nEU envoys are set to meet as early as this week to formulate a plan for measures to respond to a possible no-deal scenario with Trump, whose tariff negotiating position is seen to have stiffened ahead of an Aug. 1 deadline.\nStory Continues\nThe overwhelming preference is to keep negotiations with Washington on track in a bid for a negotiated outcome to the impasse ahead of next month’s deadline. Still, efforts have yet to yield sustained progress following talks in Washington last week, according to people familiar with the matter. Negotiations will continue over the next two weeks.\nElsewhere, inflation numbers from Japan to Brazil and testimony by the UK central bank chief are among the things in store for investors.\nClick here for what happened in the past week, and below is our wrap of what’s coming up in the global economy.\nUS and Canada\nThe US economic data calendar is relatively light and highlighted by a pair of housing market reports. On Wednesday, June data from the National Association of Realtors are projected to show a third month of scant change in sales of previously owned homes. Contract closings have been hovering near an annualized rate of 4 million, just above last year’s level that was the weakest since 2010.\nMeanwhile, economists expect a government report on Thursday to show new-home sales recovered a bit in June after posting the biggest monthly decline since 2022. The pace of contract signings on new houses has largely trended sideways for the better part of two years.\nThe housing market has struggled to gain traction as elevated mortgage interest rates and affordability constraints keep many potential buyers sidelined.\nOther reports include Friday’s release of June durable goods orders, preceded by S&P Global’s July manufacturing and services surveys on Thursday.\nFed policymakers are in a blackout period ahead of their July 29-30 meeting, although Chair Jerome Powell on Tuesday gives welcoming remarks at a conference focused on capital frameworks for large banks.\nMeanwhile, markets will be focused on any further moves in Trump’s relentless campaign to pressure the Fed into cutting rates.\nFor more, read Bloomberg Economics’ full Week Ahead for the US\nFurther north, the Bank of Canada’s business and consumer surveys for the second quarter will offer fresh insight into inflation expectations and investment plans.\nRetail data for May and a flash estimate for June are likely to show slumping sales as consumers pull back after a tariff-driven rush to buy cars earlier in the year. Two fiscal monitors from the federal government may contain more details about retaliatory tariff revenues collected to date.\nAsia\nAsia’s data docket offers a broad cross-section of economic signals, from trade in South Korea to inflation indicators in Japan, Singapore and New Zealand. The figures will help clarify how the region’s economies are responding to trade-related uncertainties.\nSouth Korea opens the week on Monday with 20-day trade data, an early indicator for July exports. Next follows consumer confidence on Wednesday and retail sales during the week, offering a read on household conditions after the Bank of Korea held rates steady this month.\nAlso on Monday, China will release loan prime rates, which are expected to be kept steady for a second month in July, taking a cue from the People’s Bank of China.\nAustralia takes the spotlight on Tuesday with minutes from the Reserve Bank’s July policy meeting, at which it shocked investors by keeping rates on hold at 3.85%.\nThe minutes may offer a clearer sense of how close policymakers are to resuming their easing cycle. RBA Governor Michele Bullock is gives a speech on Thursday.\nOn Tuesday, Taiwan is set to publish export orders for June, along with employment data.\nIndia’s July PMIs, due Thursday, will indicate the resilience of both manufacturing and services activity. Japan closes out the week on Friday with a full slate of data, including Tokyo CPI, department store sales and factory activity. The inflation reading will offer an early steer on national price trends, while the other releases will help assess how well domestic demand and production are holding up.\nNew Zealand reports second-quarter inflation on Monday, while Singapore publishes its price gauges on Wednesday and industrial production data on Friday. Thailand has car sales and customs trade balance figures during the week.\nMeanwhile, investors will be watching the fallout from Japan’s election, which according to exit polls will see the ruling coalition lose its majority in the upper house, an outcome that would further weaken embattled Prime Minister Shigeru Ishiba’s leadership and potentially unsettle markets.\nFor more, read Bloomberg Economics’ full Week Ahead for Asia\nEurope, Middle East, Africa\nThe UK will release public finance data on Tuesday at a time when its economic woes and fiscal position are very much in focus.\nWith unemployment at a four-year high and growth faltering, PMI numbers on Thursday and retail sales on Friday may also draw attention.\nBritain’s exposure to market stress may be a topic when Bank of England Governor Andrew Bailey and colleagues testify on financial stability to lawmakers on Tuesday. Their report on the matter earlier this month highlighted how UK bonds risk being hit by a wave of forced selling by highly leveraged hedge funds.\nConsumer-price numbers are among the highlights elsewhere. Data on Wednesday from South Africa will likely show inflation quickened to 3.1% in June from 2.8%, due to higher meat prices. Iceland’s equivalent numbers are published the following day.\nFor more, read Bloomberg Economics’ full Week Ahead for EMEA\nAside from the ECB, other rate decisions are scheduled across the wider region:\nNigerian policymakers will probably leave their key rate unchanged at 27.5% for a third straight meeting on Tuesday, as inflation at 22.2% remains elevated and both core and food price growth have started accelerating again.\nHungary’s central bank is expected to keep borrowing costs on hold for a 10th consecutive month the same day, despite a sluggish economy, after inflation accelerated in June.\nThe Ukrainian central bank is set to decide on policy two days later. Officials in Kyiv have kept the main rate at 15.5% since a hike in March.\nTurkish policymakers are expected to resume cutting borrowing costs on Thursday after reversing course in the face of political turbulence in March. The central bank is forecast to cut the key rate to 43.5% from 46%.\nThe Bank of Russia has indicated it’s likely to lower borrowing costs when policymakers meet on Friday, possibly by more than the 100 basis points reduction it announced in June that brought the key rate to 20% from a record high 21%.\nLatin America\nArgentina on Monday posts May GDP-proxy data. Economic activity in April jumped 1.9% from March and 7.7% a year earlier as President Javier Milei loosened some currency controls, part of a $20 billion agreement with the International Monetary Fund.\nAnalysts surveyed by Bloomberg last month marked up their year-on-year forecasts for Argentina’s second- and third-quarter output, to 8% and 4.2% respectively.\nMexico, Latin America’s No. 2 economy, takes center stage at mid-week, offering up economic activity data along with the mid-month consumer prices report.\nThe May GDP-proxy print on Tuesday comes on the heels of April’s better-than-expected readings, and after the economy flirted with a technical recession earlier in the year.\nA proliferation of headwinds — not least of which are US tariff and trade policies — has many analysts forecasting a shallow second-quarter slump, though.\nAfter a string of uncomfortably warm inflation readings, Mexico’s June prints ticked down as supply shocks cooled. Against the backdrop of forecasts for modest disinflation, the central bank has signaled that it’s likely to slow the pace of its easing cycle.\nClosing out the week, Brazil’s mid-month inflation report will likely see a third straight lower reading under the weight of the highest borrowing costs in nearly two decades.\nInflation expectations for 2025 have begun to come down, but remain above the central bank’s target to the forecast horizon.\nFor more, read Bloomberg Economics’ full Week Ahead for Latin America\n--With assistance from Beril Akman, Mark Evans, Vince Golle, Tony Halpin, Erik Hertzberg, Robert Jameson, Swati Pandey and Monique Vanek.\n(Updates with Japan elections in Asia section.)\nMost Read from Bloomberg Businessweek\nA Rebel Army Is Building a Rare-Earth Empire on China’s Border\nThailand’s Changing Cannabis Rules Leave Farmers in a Tough Spot\nHow Starbucks’ CEO Plans to Tame the Rush-Hour Free-for-All\nWhat the Tough Job Market for New College Grads Says About the Economy\nHow Taylor Swift Turned a Glitter Freckle Maker Into a Sensation\n©2025 Bloomberg L.P.\nView Comments\nTerms\nand\nPrivacy Policy\nYour Privacy Choices\nCA Privacy Notice\nMore Info\nRecommended Stories\nCopyright © 2025 Yahoo. All rights reserved.\nWhat's trending\nDow Jones\nS&P 500\nDAX Index\nNvidia\nTesla\nDJT\nTariffs\nExplore more\nMortgages\nCredit Cards\nSectors\nCrypto Heatmap\nFinancial News\nAbout\nData Disclaimer\nHelp\nFeedback\nSitemap\nLicensing\nWhat's New\nAbout Our Ads\nPremium Plans\nTerms\nand\nPrivacy Policy\nYour Privacy Choices\nCA Privacy Notice\nMore Info\nU.S. markets open in 8h 48m\nUS\nEurope\nAsia\nCryptocurrencies\nRates\nCommodities\nCurrencies\nS&P Futures\n6,341.75\n-3.00\n(-0.05%)\nDow Futures\n44,574.00\n+27.00\n(+0.06%)\nNasdaq Futures\n23,307.75\n-34.25\n(-0.15%)\nRussell 2000 Futures\n2,241.90\n-0.40\n(-0.02%)\nVIX\n16.65\n+0.24\n(+1.46%)\nGold\n3,402.50\n-3.90\n(-0.11%)\nPortfolio\nPortfolio\nSign in to access your portfolio\nSign in\nTop gainers\nSTEM\nStem, Inc.\n16.64\n+3.14\n(+23.26%)\nALAB\nAstera Labs, Inc.\n121.89\n+19.76\n(+19.35%)\nCLF\nCleveland-Cliffs Inc.\n10.66\n+1.18\n(+12.45%)\nS\nSentinelOne, Inc.\n19.78\n+1.77\n(+9.83%)\nRXRX\nRecursion Pharmaceuticals, Inc.\n6.40\n+0.56\n(+9.59%)\nTop losers\nQS\nQuantumScape Corporation\n12.52\n-2.12\n(-14.48%)\nBRKR\nBruker Corporation\n35.64\n-4.91\n(-12.12%)\nNEGG\nNewegg Commerce, Inc.\n26.34\n-3.21\n(-10.86%)\nACHR\nArcher Aviation Inc.\n11.85\n-1.44\n(-10.84%)\nAR\nAntero Resources Corporation\n32.51\n-3.80\n(-10.47%)\nMost active\nOPEN\nOpendoor Technologies Inc.\n3.2100\n+0.9600\n(+42.67%)\nLCID\nLucid Group, Inc.\n2.8200\n-0.2200\n(-7.24%)\nQS\nQuantumScape Corporation\n12.52\n-2.12\n(-14.48%)\nRIOT\nRiot Platforms, Inc.\n14.02\n+0.16\n(+1.15%)\nNVDA\nNVIDIA Corporation\n171.38\n-1.03\n(-0.60%)\nEarnings events\nTrending tickers\nOPEN\nOpendoor Technologies Inc.\n3.2100\n+0.9600\n(+42.67%)\nDJT\nTrump Media & Technology Group Corp.\n19.25\n+0.58\n(+3.11%)\nVZ\nVerizon Communications Inc.\n42.49\n+1.65\n(+4.04%)\nACHR\nArcher Aviation Inc.\n11.85\n-1.44\n(-10.84%)\nGOOG\nAlphabet Inc.\n191.15\n+5.21\n(+2.80%)\nTop economic events\nEdit your Dock\nTerms\nand\nPrivacy Policy\nYour Privacy Choices\nCA Privacy Notice\nAd Terms\nFeedback\nMore Info"
}