{
  "title": "3 Software Stocks to Buy Now If You’re Worried About Tariffs",
  "link": "https://finance.yahoo.com/news/3-software-stocks-buy-now-170002857.html",
  "published": "2025-07-19T17:00:02Z",
  "body": "2d illustration of Cloud computing by Blackboard via Shutterstock\nApril’s “Liberation Day” tariff scare wiped out trillions from the market, and some investors fear that a recent reescalation in tariff talks could trigger similar fallout.\nPresident Donald Trump recently extended the initial tariff pause to Aug. 1, however, the tariff announcements are already flowing. Investors are closely watching U.S.-China trade talks and Russia and its BRICS peers. New tariffs on copper recently, for instance, set the market in motion.\nMore News from Barchart\nIt’s Never ‘Happened in the History of Tech to Any Company Before’: OpenAI’s Sam Altman Says ChatGPT is Growing at an Unprecedented Rate\nDitch ‘Basic’ Nvidia and Buy This ‘Unique’ Chip Stock Instead\nTesla Earnings, Powell Speech and Other Can't Miss Items this Week\nStop Missing Market Moves: Get the FREE Barchart Brief – your midday dose of stock movers, trending sectors, and actionable trade ideas, delivered right to your inbox. Sign Up Now!\nNo matter how things shake out, one of the hottest corners of the market is mostly free from tariffs.\nAccording to Morgan Stanley analysts, tariffs “don’t matter” for software stocks. Here are three especially poised to win in the months ahead.\nSoftware Stock #1: Okta (OKTA)\nwww.barchart.com\nOkta (OKTA) is a software company specializing in identity and access management, helping corporate clients with secure user authentication.\nMomentum in this niche is unlikely to slow due to tariffs. Q1 revenue rose 12% year-over-year to $688 million, and subscription revenue hit $673 million. Free cash flow also jumped to $238 million, a 35% margin that dwarfs most hardware-oriented tech peers.\nOkta closed the quarter with $2.725 billion in cash and short-term investments and only modest debt. Management believes adjusted operating income will grow to between $710 million to $720 million this fiscal year.\nThings look very healthy here. The company turned profitable around a year ago and has successfully trimmed debt and increased cash while increasing both margins and revenue. OKTA stock is also down 30% from its three-year peak, so there’s good upside ahead if management can maintain this trajectory.\nThe mean price target of $123.92 implies 30% upside.\nwww.barchart.com\nSoftware Stock #2: Autodesk (ADSK)\nwww.barchart.com\nAutodesk (ADSK) is a company that provides a broad range of software products for engineering and design. Its design software is viewed as essential infrastructure, and canceling a software license that costs a few thousand dollars does nothing to dodge a tariff, so corporate clients keep renewing. Plus, Autodesk derives most of its revenue from the U.S.\nStory Continues\nThe company closed fiscal 2025 with record-high revenue of $6.13 billion, up 12%. That was followed up by 15% year-over-year growth in Q1 of its fiscal 2026.\nOne other catalyst to watch? Autodesk stands to benefit from the onshoring trend, which could see its revenue growth accelerate.\nThe mean analyst price target here is $339.58, implying 16% upside potential. That price target is likely to go up as analysts re-rate shares on renewed artificial intelligence optimism. For instance, Berenberg upgraded it in late June to a $365 price target, followed by DA Davidson upgrading from a “Neutral” rating to a “Buy,” with a $375 price target.\nwww.barchart.com\nSoftware Stock #3: CrowdStrike (CRWD)\nwww.barchart.com\nCrowdStrike (CRWD) stock is up 370% in the past five years, and the solid performance looks set to continue. Its cloud-native, subscription-heavy model makes it one of the cleanest ways to sidestep trade friction while still carving out double-digit growth.\nRoughly 95.5% of its $1.1 billion in fiscal Q1 revenue was derived from subscription dollars, and the marginal cost of adding one more customer is close to zero. Management guided Q2 to $1.145 billion to $1.152 billion and lifted the full-year outlook to $4.74 billion to $4.81 billion, or around 19% to 20% growth year-over-year.\nA broad tech sector decline would stunt margin gains, but CrowdStrike is still well-positioned to keep performing in the long run.\nThe mean price target is $483.86, with price targets going up to $575.\nwww.barchart.com\nOn the date of publication, Omor Ibne Ehsan did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on\nBarchart.com",
  "read_time": 3
}