{
  "title": "3 Tech Stocks With More Potential Than Any Cryptocurrency",
  "link": "https://finance.yahoo.com/news/3-tech-stocks-more-potential-155400605.html",
  "published": "2025-07-19T15:54:00Z",
  "body": "In This Article:\nSNAP\nLMND\nAEHR\nKey Points\nSnap continues to grow in the shadow of its bigger social media competitors.\nLemonade will keep expanding its AI-powered niche of the insurance market.\nAehr could profit from the growth of the EV and AI markets.\n10 stocks we like better than Snap ›\nCryptocurrencies might seem like good investments for speculative investors since many of the top tokens delivered market-crushing gains over the past decade. Yet past performance never guarantees future gains -- and a lot of cryptocurrencies still trade on the headlines instead of their scarcity or the utility of their underlying blockchains.\nInstead of loading up your portfolio with risky cryptocurrencies, it might be smarter to invest in some high-growth tech stocks, instead. Here's a look at three of those stocks --\nSnap\n(NYSE: SNAP)\n,\nLemonade\n(NYSE: LMND)\n, and\nAehr Test Systems\n(NASDAQ: AEHR)\n-- to see why they might be better buys than any cryptocurrency.\nImage source: Getty Images.\nSnap\nSnap, the parent company of Snapchat,\nsuffered a slowdown\nin 2023. This was due to\nApple\n's privacy changes on iOS, intense competition from ByteDance's TikTok and\nMeta\n's Instagram, and tough macro headwinds, which all throttled the company's ad sales. It also struggled to gain new daily active users (DAUs) in its core North American market.\nBut in 2024, Snap's revenue rose 16%. That acceleration was driven by:\nRobust overseas growth\nFresh first-party ad tools that addressed Apple's iOS changes\nSnapchat+ subscriptions\nArtificial intelligence (AI)-powered AR lenses\nSpotlight's video recommendations\nIn the first quarter of 2025, the company's DAUs grew 9% year over year to a record high of 460 million.\nSnap didn't provide any additional guidance because it expects the tariffs and macro headwinds to impact its ad sales to Chinese e-commerce companies. But for the full year, analysts still expect revenue to rise 9% to $5.84 billion as the company's adjusted earnings before interest, taxes, depreciation, and amortization (\nEBITDA\n) grows 6%. From 2024 to 2027, they expect revenue and adjusted EBITDA to grow at a compound annual growth rate (CAGR) of 10% and 32%, respectively.\nThese are solid growth rates for a stock that trades at just 3x this year's sales and 29x adjusted EBITDA. If Snap continues to expand, it might impress the bulls again and beat the top cryptocurrencies.\nLemonade\nLemonade carved out a high-growth niche in the insurance market with its AI-driven platform, which streamlines the onboarding and claims process with chatbots and algorithms. That digital-native approach made it a popular option for younger and first-time insurance buyers.\nStory Continues\nLemonade initially only offered homeowners' and renters' insurance but expanded with more term life, pet health, and auto plans after its public debut five years ago. It also ceded a portion of the risks from those plans to big reinsurers to insulate itself from bigger losses.\nThe company's growth in customers and in-force premiums slowed down in 2023 as it struggled with delayed rate approvals for its home and auto policies in several states. Those delays forced it to approve fewer policies and curb its near-term expansion.\nBut in 2024, Lemonade's growth accelerated again as it secured those new rate approvals. In addition, its AI-driven pricing model was approved in more states and it ramped up spending again to gain new customers. In the first quarter of 2025, the number of customers grew 21% year over year to a record high of 2.55 million.\nFrom 2024 to 2027, analysts expect Lemonade's revenue to rise at a CAGR of 41% as its adjusted EBITDA turns positive by the final year. That's an impressive growth rate for a stock that trades at just 4x this year's sales. If the company keeps locking in new customers, it could deliver bigger gains than a lot of cryptocurrencies.\nAehr Test Systems\nAehr produces testing and burn-in equipment for chipmakers. It went public back in 1997 but didn't gain much attention until 2021. That's when investors recognized it as a play on silicon carbide (SiC) chips, which can resist higher voltages, operate at higher temperatures, and run on higher frequencies than traditional silicon chips.\nThat resilience makes SiC chips well-suited for lasers, 5G base stations, radars, and electric vehicles (EVs). Aehr is one of the few companies that produce testing and burn-in equipment for SiC chips.\nAehr's revenue declined in fiscal 2025 (which ended this May) as it grappled with a soft EV market, tariff-related delays, and a higher mix of cheaper products. But from fiscal 2025 to fiscal 2027, analysts expect its revenue to grow at a CAGR of 22%. They also expect its adjusted EBITDA to turn positive in fiscal 2025 and grow 58% in fiscal 2026.\nAehr's near-term catalysts include the AI market's growing demand for its testing and burn-in tools, the EV market's gradual recovery, the expansion of its portfolio with new gallium nitride (GaN) chips and silicon photonics products, and its international expansion. Its stock still looks reasonably valued at 7x this year's sales and could gain a lot more momentum as the EV market warms up and the AI market continues to expand.\nShould you invest $1,000 in Snap right now?\nBefore you buy stock in Snap, consider this:\nThe\nMotley Fool Stock Advisor\nanalyst team just identified what they believe are the\n10 best stocks\nfor investors to buy now… and Snap wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when\nNetflix\nmade this list on December 17, 2004... if you invested $1,000 at the time of our recommendation,\nyou’d have $652,133\n!* Or when\nNvidia\nmade this list on April 15, 2005... if you invested $1,000 at the time of our recommendation,\nyou’d have $1,056,790\n!*\nNow, it’s worth noting\nStock Advisor’s\ntotal average return is 1,048\n% — a market-crushing outperformance compared to 180% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join\nStock Advisor\n.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2025\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors.\nLeo Sun\nhas positions in Apple and Meta Platforms. The Motley Fool has positions in and recommends Apple, Lemonade, and Meta Platforms. The Motley Fool has a\ndisclosure policy\n.\n3 Tech Stocks With More Potential Than Any Cryptocurrency\nwas originally published by The Motley Fool",
  "read_time": 5
}