{
  "title": "After Plummeting Over $1 Trillion in Value, This Super Artificial Intelligence (AI) Stock Is Mounting a Major Comeback, With Analysts Predicting Gains of Up to 400%",
  "link": "https://finance.yahoo.com/news/plummeting-over-1-trillion-value-160000835.html",
  "published": "2025-07-19T16:00:00Z",
  "body": "In This Article:\nNVDA\nMSFT\nAMZN\nTSLA\nKey Points\nNvidia stock took a nosedive earlier this year thanks to concerns over tariffs and competition in China.\nThese fears have subsided over the last couple of months, and positive investor sentiment has fueled Nvidia stock to new highs.\nSome on Wall Street think the Nvidia train can keep moving, potentially reaching a $20 trillion valuation over the next five years.\n10 stocks we like better than Nvidia ›\nFor a few years now, the artificial intelligence (AI) movement has largely hinged on the performance of a single company:\nNvidia\n(NASDAQ: NVDA)\n.\nSure, if\nMicrosoft\nor\nAmazon\nposted strong results from their respective cloud computing platforms or if\nTesla\nmanaged to hype investors up over the prospects of self-driving robotaxis or humanoid robots, the technology sector might see a fleeting upward movement. At the end of the day, however, the focus seemed to eventually return to Nvidia -- with analysts obsessing over how demand for the company's chips and data center services were trending.\nDuring the first half of the year, Nvidia's ship was caught in an epic storm. Investors started to question the company's long-growth prospects -- inspiring prolonged periods of panic-selling in the process. All told, Nvidia's market cap dropped by more than $1 trillion.\nBut now, with a market value north of $4 trillion, Nvidia has reclaimed its position as the most valuable company on the planet. Even better? Some on Wall Street are calling for further gains of up to 400%.\nLet's explore the tailwinds supporting Nvidia's long-term growth narrative and detail why Wall Street sees such massive upside for the king of the chip realm.\nOne Wall Street analyst is calling for a $10 trillion valuation for Nvidia\nOne of the most bullish Nvidia analysts on Wall Street is the I/O Fund's\nBeth Kindig\n. Kindig suggested that Nvidia could reach a $10 trillion market cap by 2030 -- implying 140% upside from current levels. Let's explore the main catalysts supporting Kindig's forecast.\nAccording to management from Microsoft, Amazon, and\nAlphabet\n, roughly $260 billion will be spent in 2025 alone on AI infrastructure. On top of that,\nMeta Platforms\nis expected to spend roughly $70 billion on capital expenditures this year -- nearly double what it spent in 2024. Lastly,\nOracle\nis beginning to make significant headway in infrastructure services -- allowing companies to rent Nvidia GPUs from their cloud-based data center platform. From a macro perspective, rising capex from the cloud hyperscalers bodes well for chip demand.\nStory Continues\nKindig takes these secular tailwinds one step further, suggesting that competition from\nIntel\nand\nAdvanced Micro Devices\ndoes not pose much of a threat to Nvidia's dominance. While it's hard to know how vendor preferences could change over the next several years, current industry research trends suggest that Kindig might be right -- underscored by\nNvidia's rising market share in the AI accelerator industry\n.\nThe area of Kindig's analysis that I think is currently overlooked the most revolves around Nvidia's software architecture, called CUDA. Since CUDA is integrated tightly with Nvidia's hardware, developers essentially become locked into the company's ecosystem.\nNot only does this lead to customer stickiness, but it opens the door for Nvidia to be at the forefront of more sophisticated, evolving AI applications in areas such as robotics and autonomous driving.\nImage source: Getty Images.\nWhat about $20 trillion?\nFormer management consulting executive Phil Panaro is even more bullish than Kindig. By 2030, Panaro thinks Nvidia's share price could reach $800 -- implying roughly a $20 trillion market cap.\nPanaro cites opportunities across Web3 development and evolving use cases around how enterprises and governments leverage AI to generate more efficiency and cost savings as the main pillars supporting Nvidia's upside.\nWhile these trends could eventually drive significant demand for Nvidia's data center services, tech adoption within the government tends to move slowly. Meanwhile, Web3 remains an emerging concept that could take far longer to mature than Panaro is assuming.\nIs Nvidia stock a buy right now?\nNvidia stock has been mounting an epic comeback over the last couple of months. This valuation expansion can be easily seen through the dynamics of the company's rising forward price-to-earnings (P/E) multiple. Nevertheless, Nvidia's forward P/E of 40 is still well below levels seen earlier this year.\nNVDA PE Ratio (Forward)\ndata by\nYCharts\nTrying to model Nvidia's peak valuation is an exercise in false precision. The bigger takeaway is that analysts on Wall Street are not only calling for significant upside in the stock, but they have outlined the foundation for Nvidia's long-term growth. The important theme here is that Nvidia has opportunities well beyond selling chips -- many of which have yet to make meaningful contributions to the business.\nI see Nvidia stock as a no-brainer. Investors with a long-run time horizon might consider scooping shares up at current prices and plan to hold on for years to come.\nShould you buy stock in Nvidia right now?\nBefore you buy stock in Nvidia, consider this:\nThe\nMotley Fool Stock Advisor\nanalyst team just identified what they believe are the\n10 best stocks\nfor investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when\nNetflix\nmade this list on December 17, 2004... if you invested $1,000 at the time of our recommendation,\nyou’d have $652,133\n!* Or when\nNvidia\nmade this list on April 15, 2005... if you invested $1,000 at the time of our recommendation,\nyou’d have $1,056,790\n!*\nNow, it’s worth noting\nStock Advisor’s\ntotal average return is 1,048\n% — a market-crushing outperformance compared to 180% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join\nStock Advisor\n.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2025\nJohn Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors.\nAdam Spatacco\nhas positions in Alphabet, Amazon, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Intel, Meta Platforms, Microsoft, Nvidia, Oracle, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft, short August 2025 $24 calls on Intel, and short January 2026 $405 calls on Microsoft. The Motley Fool has a\ndisclosure policy\n.\nAfter Plummeting Over $1 Trillion in Value, This Super Artificial Intelligence (AI) Stock Is Mounting a Major Comeback, With Analysts Predicting Gains of Up to 400%\nwas originally published by The Motley Fool",
  "read_time": 5
}