{
  "title": "Better Trump-Connected Meme Stock: Newsmax vs. Trump Media",
  "link": "https://finance.yahoo.com/news/better-trump-connected-meme-stock-160500481.html",
  "published": "2025-07-19T16:05:00Z",
  "body": "Key Points\nNewsmax is dealing with growing pains and unpredictable legal expenses.\nTrump Media's core business is withering as it tries to launch a crypto ETF.\nNewsmax has cooled off, but Trump Media still trades at frothy valuations.\n10 stocks we like better than Newsmax ›\nNewsmax\n(NYSE: NMAX)\nand\nTrump Media & Technology Group\n(NASDAQ: DJT)\nare both closely associated with President Donald Trump. Newsmax, which bills itself as a conservative alternative to mainstream media networks like Fox News, is popular among Trump supporters. Trump Media, which was co-founded by Trump, owns the social network Truth Social and the streaming media platform Truth+. It aims to be an alternative to larger social media platforms.\nBoth stocks, through their association with Trump, became\nmeme stocks\nshortly after their public debuts, trading on emotion. Newsmax went public via a traditional initial public offering (IPO) on March 31, and it soared from its debut price of $10 to a record closing price of $233 the following day. Trump Media went public by merging with a special purpose acquisition company (\nSPAC\n) on March 26, 2024. It started trading at $70.90 -- which marked a 42% gain from its premerger closing price.\nImage source: Getty Images.\nBut today, Newsmax and Trump Media trade at about $14 and $18, respectively. Both stocks crumbled under the weight of their skyrocketing valuations. But which is the better buy?\nNewsmax faces a lot of near-term challenges\nNewsmax operates both linear TV and digital streaming channels, and it generates most of its revenue from ads, cable licensing fees, and subscription fees. It claims to reach 40 million Americans through its media channels and print publications.\nNielsen\ndata from April found that Newsmax was tied with Fox News among 35- to 64-year-old viewers for \"prime engagement.\"\nNewsmax's viewership grew significantly during the first Trump administration, but it was also criticized for promoting conspiracy theories regarding the 2020 elections, the Jan. 6 attack on the U.S. Capitol, and the risk of COVID-19 vaccines. Voting system makers Smartmatic and Dominion sued Newsmax over its claims about the 2020 election. It reached a $40 million settlement with Smartmatic last year, but it hasn't settled with Dominion yet.\nIn 2023, Newsmax's revenue stayed flat at $135 million as its net loss more than doubled to $42 million. That slowdown was largely caused by DirecTV temporarily dropping its channels in a carriage fee dispute. Newsmax had wanted to transition from a free-to-air model to a paid one as its popularity grew, but DirecTV rejected those new carriage fees. Newsmax eventually agreed to revert back to its original free model (and earn a split of the carrier's ad revenue) to return to DirecTV.\nStory Continues\nIn 2024, Newsmax's revenue rose 27% to $171 million as the U.S. election cycle heated up again and drove more viewers to its linear and digital channels. However, its net loss widened to $72 million as its settlement with Smartmatic and the costs of expanding its infrastructure to handle its growing audience crushed its operating margins.\nIn the first quarter of 2025, Newsmax's revenue rose 12% year over year to $45 million. It narrowed its net loss from $51 million to $17 million, but that was mainly due to its easy year-over-year comparisons to the Smartmatic settlement. Analysts haven't provided any forecasts for the rest of the year, but it could face a lot of pressure as it laps the election, ramps up its spending, and deals with the legal costs in its ongoing dispute with Dominion.\nTrump Media is still leaving its investors in the dark\nTrump Media generates most of its revenue from Truth Social, but it doesn't disclose its monthly active users (MAUs) or any other core social media metrics. According to SEO.ai, it only served 6.3 million MAUs this January. It recently launched its Truth+ streaming media platform, but the Android version of its app has only been downloaded about 50,000 times.\nRumble\n(NASDAQ: RUM)\n, the conservative-leaning streaming video platform, says it reached 59 million MAUs in its latest quarter.\nIn 2023, Trump Media only generated $4.1 million in revenue as it racked up a net loss of $58.2 million. In 2024, its revenue declined to $3.6 million as its net loss widened to $401 million. That decline was caused by Truth Social's stagnating growth, competition from bigger social media platforms like X and\nMeta Platforms\n' Facebook, and a renegotiated ad revenue sharing deal with an \"undisclosed\" advertising partner. Its massive net loss was caused by its ballooning stock-based compensation expenses, higher legal costs, changes to how its warrants and convertible debt was valued, and soaring interest charges on its debt.\nIn the first quarter of 2025, Trump Media generated just $821,000 in revenue with a net loss of $31.7 million. But in early July, it submitted a filing for a new crypto exchange-traded fund (ETF) that would bundle\nBitcoin\nwith several other cryptocurrencies. If approved, that ETF might boost its cash flows while diversifying its business away from its sluggish social networking and streaming media businesses.\nThe better buy: Newsmax\nWith a market cap of $1.85 billion, Newsmax isn't cheap at 11 times last year's sales. But it's more reasonably valued than Trump Media, which is worth $5.13 billion -- or 1,475 times last year's sales. So while Newsmax's future is still murky, it certainly looks like the better buy.\nIf you believe Newsmax will keep gaining more viewers in this politically divisive environment, pull more viewers away from Fox News and other mainstream media networks, and resolve its legal issues, it might be worth nibbling on. But if you don't think it can check all three boxes, it might be too risky to buy.\nShould you buy stock in Newsmax right now?\nBefore you buy stock in Newsmax, consider this:\nThe\nMotley Fool Stock Advisor\nanalyst team just identified what they believe are the\n10 best stocks\nfor investors to buy now… and Newsmax wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when\nNetflix\nmade this list on December 17, 2004... if you invested $1,000 at the time of our recommendation,\nyou’d have $652,133\n!* Or when\nNvidia\nmade this list on April 15, 2005... if you invested $1,000 at the time of our recommendation,\nyou’d have $1,056,790\n!*\nNow, it’s worth noting\nStock Advisor’s\ntotal average return is 1,048\n% — a market-crushing outperformance compared to 180% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join\nStock Advisor\n.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2025\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors.\nLeo Sun\nhas positions in Meta Platforms. The Motley Fool has positions in and recommends Bitcoin and Meta Platforms. The Motley Fool has a\ndisclosure policy\n.\nBetter Trump-Connected Meme Stock: Newsmax vs. Trump Media\nwas originally published by The Motley Fool",
  "read_time": 6
}