{
  "title": "Energy Fuels (UUUU) Jumps 41.8% on Rare Earth Boom Ride",
  "link": "https://finance.yahoo.com/news/energy-fuels-uuuu-jumps-41-175049359.html",
  "published": "2025-07-19T17:50:49Z",
  "body": "In This Article:\nEFR.TO\nWe recently published\n10 Stocks With Unbelievable Gains This Week\n. Energy Fuels Inc. (NYSEAmerican:UUUU) is one of this week’s biggest players.\nEnergy Fuels skyrocketed by 41.82 percent week-on-week, closing Friday’s session at $9.36 versus the $6.6 finish on July 11, bolstered by news that it has begun the production of heavy rare earth oxide.\nIn a statement, Energy Fuels Inc. (NYSEAmerican:UUUU) said that it is now underway with the production of Dysprosium oxide, also known as dysprosia, at its White Mesa Mill in Utah.\nThe chemical compound is expected to have a minimum purity of 99.5 percent and exceed 99.9 percent purity.\nEnergy Fuels Inc. (NYSEAmerican:UUUU) said it targets to complete the production of the first kilogram of the compound within the next 30 days, and expects to continue production on a pilot scale until the end of September 2025, at which it expects to have produced 15 kgs—enough to generate residuals to feed its Terbium circuit beginning October 2025.\nEnergy Fuels (UUUU) Jumps 41.8% on Rare Earth Boom Ride\nCopyright:\ntomas1111 / 123RF Stock Photo\nIf progress continues as planned, the company also targets to kick off production of samarium oxide on a pilot scale in January 2026.\nAccording to Energy Fuels Inc. (NYSEAmerican:UUUU) President and CEO Mark Chalmers, the company is now in a unique position to produce the heavy rare earth oxides needed by US industries to make rare earth metals, alloys and magnets.\nWhile we acknowledge the potential of UUUU as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on the\nbest short-term AI stock\n.\nREAD NEXT:\n30 Stocks That Should Double in 3 Years\nand\n11 Hidden AI Stocks to Buy Right Now\n.\nDisclosure: None. This article is originally published at\nInsider Monkey\n.",
  "read_time": 2
}