{
  "title": "Futu (FUTU) Holdings Jumps 7% on Bullish Rating, Price Target Upgrade",
  "link": "https://finance.yahoo.com/news/futu-futu-holdings-jumps-7-183247804.html",
  "published": "2025-07-19T18:32:47Z",
  "body": "In This Article:\nFUTU\nWe recently published\nThese 10 Stocks Surprisingly Lead Gains While Wall Street Naps\n. Futu Holdings Limited (NASDAQ:FUTU) is one of this week’s top performers.\nFutu Holdings ended the last trading day of the week gaining 7 percent to close at $160.57 apiece as investors took heart from an investment firm’s bullish rating for the company.\nIn its initial coverage, Barclays assigned an “overweight” rating on Futu Holdings Limited’s (NASDAQ:FUTU) stock with a price target of $176 or a 9.6-percent upside from its latest closing price.\nBarclays underscored Futu Holdings Limited’s (NASDAQ:FUTU) strong position in the Asian market, and that its 20-25 percent growth in client base, assets under management (AUM), and revenues could continue and accelerate in the coming years, especially with its rapid expansion in Malaysia and Japan.\nFutu (FUTU) Holdings Jumps 7% on Bullish Rating, Price Target Upgrade\nA brokerage employee huddled with a group of retirees discussing retirement portfolios.\nAccording to Barclays, Futu Holdings Limited (NASDAQ:FUTU) is comparable to brokerage giants namely Robinhood, Coinbase, Fidelity, and Charles Schwab.\nFutu Holdings Limited (NASDAQ:FUTU) currently serves 2.7 million retail investors with AUM exceeding $100 billion.\nWhile we acknowledge the potential of FUTU as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on the\nbest short-term AI stock\n.\nREAD NEXT:\n30 Stocks That Should Double in 3 Years\nand\n11 Hidden AI Stocks to Buy Right Now\n.\nDisclosure: None. This article is originally published at\nInsider Monkey\n.",
  "read_time": 1
}