{
  "title": "Is the Schwab U.S. Dividend Equity ETF a Buy Now?",
  "link": "https://finance.yahoo.com/news/schwab-u-dividend-equity-etf-151300986.html",
  "published": "2025-07-19T15:13:00Z",
  "body": "In This Article:\nSCHD\n^DJI\nKey Points\nThe Schwab U.S. Dividend Equity ETF has attracted 24% more assets in the past year, far outpacing rival dividend funds.\nWhile SCHD's price gains lag the broader market, its superior dividend yield makes up much of the difference for patient investors (and income seekers).\n10 stocks we like better than Schwab U.S. Dividend Equity ETF ›\nThe\nSchwab U.S. Dividend Equity ETF\n(NYSEMKT: SCHD)\nis a popular index fund, tied to the\nDow Jones U.S. Dividend 100\nindex. The index and fund focus on generous, high-quality\ndividend policies\n. As a result, the ETF is centered around the classic dividend payer sectors of energy, consumer staples, and healthcare.\nThis is indeed a very popular fund. With $70.1 billion of assets under management, the Schwab Dividend Equity fund ranks among the 30 largest exchange-traded funds (ETFs) today.\nBut is it a good ETF to buy today? Let's dive a little deeper into the Schwab U.S. Dividend Equity ETF.\nImage source: Getty Images.\nInvestors are pouring money into this Schwab fund\nThis fund is having a moment in the sun right now. Among the five largest dividend-focused ETFs, the fund has seen the largest capital inflows over the last year -- by far. Its asset portfolio has grown by 24% in 52 weeks, far ahead of runner-up\niShares Core Dividend Growth ETF\n(NYSEMKT: DGRO)\nat 5%.\nIncome investors often care less about stock prices than other investor types do, but the price performance still matters.\nSo it should be noted that the Schwab U.S. Dividend Equity fund tends to underperform broad market trackers like the\nS&P 500\n(SNPINDEX: ^GSPC)\nin the long run. The Schwab ETF's average annual price gain over the last decade was 7.6%, well behind the S&P 500's average increase of 11.5%. The competing dividend ETF from iShares posted a stronger yearly increase of 9.3%, but neither one could come close to the overall stock market's price gains.\nThis period includes three presidential elections, the coronavirus pandemic, the start of the artificial intelligence (AI) boom, and the panic-and-recovery inflation cycle from 2022 to 2024. Price gains recorded across that diverse time period should be fairly representative of average long-term results.\nBut wait, there's more (dividends, that is)\nThe picture changes dramatically when you include dividend payouts in the performance charts.\nThe S&P 500's average dividend yield over the last decade stopped at 1.7%. The iShares dividend fund floated around a much richer 2.3%, but the Schwab Dividend Equity ETF came out on top. Its average yield was 3.1%.\nAs a very direct result, the Schwab fund delivered a robust\ntotal return\nof 11.1% per year over the last decade. This metric assumes that any dividends along the way were reinvested in more shares of the same stock or fund -- a fantastic advantage for this generous dividend payer.\nStory Continues\nBeing out of favor can create opportunities\nLarge-cap stocks with high-quality dividend plans haven't exactly been market darlings recently. After an underwhelming performance in recent months, the Schwab fund is stuck 9% below its annual highs and 14% above recent lows. Meanwhile, the broader market is setting new price records on a regular basis.\nOn the upside of a soft price chart, the Schwab U.S. Dividend Equity ETF offers an above-average dividend yield of 4% right now. You can lock in that effective yield by grabbing some shares today. The fund's largest holdings include world-class businesses like\nCoca-Cola\n,\nThe Home Depot\n, and\nChevron\n-- long-term cash machines that should survive pretty much any economic calamity I could imagine. From this perspective, the dividend fund also serves as a direct bet on top-quality business giants. That concept often goes hand in hand with generous and consistently growing dividend payouts.\nIt's also a low-cost index fund with an annual expense ratio of 0.06%. And if you like the stock list of the underlying Dow Jones U.S. Dividend 100 index, this Schwab fund appears to be the only ETF that follows this exact index.\nIs the SCHD ETF right for you?\nFully committed income investors could very well build their portfolio around this robust ETF. Others can include it to get deeper exposure to the dividend-rich corner of Wall Street, or to skew their holdings closer to large-cap value investments.\nEither way, this period of lagging price performance looks like a good time to explore the Schwab U.S. Dividend Equity ETF. You don't need to back up your proverbial truck, but this ETF looks like a solid buy today.\nShould you invest $1,000 in Schwab U.S. Dividend Equity ETF right now?\nBefore you buy stock in Schwab U.S. Dividend Equity ETF, consider this:\nThe\nMotley Fool Stock Advisor\nanalyst team just identified what they believe are the\n10 best stocks\nfor investors to buy now… and Schwab U.S. Dividend Equity ETF wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when\nNetflix\nmade this list on December 17, 2004... if you invested $1,000 at the time of our recommendation,\nyou’d have $652,133\n!* Or when\nNvidia\nmade this list on April 15, 2005... if you invested $1,000 at the time of our recommendation,\nyou’d have $1,056,790\n!*\nNow, it’s worth noting\nStock Advisor’s\ntotal average return is 1,048\n% — a market-crushing outperformance compared to 180% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join\nStock Advisor\n.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2025\nAnders Bylund\nhas no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Chevron and Home Depot. The Motley Fool has a\ndisclosure policy\n.\nIs the Schwab U.S. Dividend Equity ETF a Buy Now?\nwas originally published by The Motley Fool",
  "read_time": 5
}