{
  "title": "Joby Aviation (JOBY) Soars 48% on Aggressive Expansion",
  "link": "https://finance.yahoo.com/news/joby-aviation-joby-soars-48-173616652.html",
  "published": "2025-07-19T17:36:16Z",
  "body": "In This Article:\nJOBY\nWe recently published\n10 Stocks With Unbelievable Gains This Week\n. Joby Aviation, Inc. (NYSE:JOBY) is one of this week’s biggest players.\nJoby Aviation soared by 47.67 percent week-on-week to close at $17.78 versus the $12.04 finish on July 11, as investor confidence was boosted by its aggressive expansion plans.\nIn a statement earlier last week, Joby Aviation, Inc. (NYSE:JOBY) announced that it was underway with the expansion of its facilities in Dayton, Ohio and Marina, California, to accommodate the targeted annual production of 500 and 24 aircraft, respectively.\nThe facilities form part of Joby Aviation, Inc.’s (NYSE:JOBY) four total manufacturing sites, with the two others located in Santa Cruz, California.\nAccording to Joby Aviation, Inc. (NYSE:JOBY), the Marina expansion will also provide other key capabilities, including initial FAA production certification, conforming ground and flight testing components, pilot training simulators, and aircraft maintenance, among others.\nJoby Aviation (JOBY) Soars 48% on Aggressive Expansion\nJirat Teparaksa/Shutterstock.com\nBased on its historical reporting dates, Joby Aviation, Inc. (NYSE:JOBY), a company heavily backed by giant carmaker Toyota Motors, is expected to release the results of its second quarter earnings performance in the first week of August 2025.\nWhile we acknowledge the potential of JOBY as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on the\nbest short-term AI stock\n.\nREAD NEXT:\n30 Stocks That Should Double in 3 Years\nand\n11 Hidden AI Stocks to Buy Right Now\n.\nDisclosure: None. This article is originally published at\nInsider Monkey\n.",
  "read_time": 1
}