{
  "title": "MP Materials (MP) Soars 40% on Multi-Billio Dollar Deals",
  "link": "https://finance.yahoo.com/news/mp-materials-mp-soars-40-180105194.html",
  "published": "2025-07-19T18:01:05Z",
  "body": "In This Article:\nMP\nAAPL\nWe recently published\n10 Stocks With Unbelievable Gains This Week\n. MP Materials Corp. (NYSE:MP) is one of this week’s biggest players.\nMP Materials climbed by 40.15 percent week-on-week to hit a new all-time high as investors gobbled up shares after clinching a $500-million partnership with technology giant Apple Inc.\nAt intra-day trading on Friday, MP Materials Corp. (NYSE:MP) touched a new 52-week high of $64.51 before a slight profit-taking pulled its shares to end the day at $63.22.\nThe rally followed news from Apple that it committed to gobble up US-made rare earth magnets from MP Materials Corp.’s (NYSE:MP) flagship Independence facility in Fort Worth, Texas, and that it would work with the company to build out a state-of-the-art Texas factory with a series of neodymium magnet manufacturing lines specifically designed for Apple products. The initiative is expected to boost MP Materials Corp.’s (NYSE:MP) overall production.\nMP Materials (MP) Soars 40% on Multi-Billio Dollar Deals\nOnce built, the produced magnets will be shipped across the country and all over the world.\nPrior to its partnership with Apple, MP Materials Corp. (NYSE:MP) also sealed a multi-billion-dollar deal and $400 million investment with the Department of Defense (DOD) to ramp up the production of rare earth minerals in the US.\nWhile we acknowledge the potential of MP as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on the\nbest short-term AI stock\n.\nREAD NEXT:\n30 Stocks That Should Double in 3 Years\nand\n11 Hidden AI Stocks to Buy Right Now\n.\nDisclosure: None. This article is originally published at\nInsider Monkey\n.",
  "read_time": 2
}