{
  "title": "Rigetti Computing (RGTI) Surges 40.89% on New Milestone Achievement",
  "link": "https://finance.yahoo.com/news/rigetti-computing-rgti-surges-40-175658958.html",
  "published": "2025-07-19T17:56:58Z",
  "body": "In This Article:\nRGTIW\nRGTI\nWe recently published\n10 Stocks With Unbelievable Gains This Week\n. Rigetti Computing, Inc. (NASDAQ:RGTI) is one of this week’s biggest players.\nRigetti Computing soared by 40.89 percent week-on-week to close Friday’s trading at $17.16 versus the $12.18 on July 11 as investors cheered the achievement of a new milestone that effectively reduced its error rate by half.\nIn a statement earlier in the week, Rigetti Computing, Inc. (NASDAQ:RGTI) said that its modular 36-qubit system achieved its mid-year performance milestone of 99.5 percent median two-qubit gate fidelity, or a 2x reduction in median two-qubit gate error rate from its previous best results on the 84-qubit single-chip Ankaa-3 system.\nComposed of four 9-qubit chips tiled together, the 36-qubit system is based on Rigetti Computing, Inc.’s (NASDAQ:RGTI) proprietary modular chip technology and unlocks the company’s path to building a 100+ qubit chiplet-based system.\nRigetti Computing (RGTI) Surges 40.89% on New Milestone Achievement\nA laptop and a computer monitor display a detailed stock market technical analysis chart. Photo by Jakub Zerdzicki on Pexels\nAccording to the company, it is on track to launch its 36-qubit system on August 15, as well as its 100+ qubit chiplet-based system at 99.5 percent median two-qubit gate fidelity, before the end of the year.\nWhile we acknowledge the potential of RGTI as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on the\nbest short-term AI stock\n.\nREAD NEXT:\n30 Stocks That Should Double in 3 Years\nand\n11 Hidden AI Stocks to Buy Right Now\n.\nDisclosure: None. This article is originally published at\nInsider Monkey\n.",
  "read_time": 2
}