{
  "title": "TD Cowen Maintains a Buy on ServiceNow (NOW), Keeps the PT at $1,150",
  "link": "https://finance.yahoo.com/news/td-cowen-maintains-buy-servicenow-043503165.html",
  "published": "2025-07-20T04:35:03Z",
  "body": "In This Article:\nNOW\nServiceNow, Inc. (NYSE:\nNOW\n) is one of the best\nlong term low volatility stocks to buy now\n. On July 16, TD Cowen analyst Derrick Wood maintained a Buy rating on ServiceNow, Inc. (NYSE:NOW), keeping the price target at $1,150.00.\nServiceNow, Inc. (NOW) Is Competing With The Rise Of AI, Says Jim Cramer\nA team of software engineers at desks working on code for a cutting-edge cloud computing solution.\nThe analyst reasoned that ServiceNow, Inc. (NYSE:NOW) is suitably positioned for future growth and has exhibited strong performance in the enterprise segment, especially with its AI-related projects.\nThe firm expects favorable foreign exchange trends and the company’s traction with its GenAI product cycle to be additional growth drivers for its financial performance.\nThe analyst also stated that ServiceNow, Inc. (NYSE:NOW) has a strong track record with a significant beat in fiscal Q1 results and has set a lower guidance bar, which may result in a beat and raise the scenario in the upcoming quarters.\nServiceNow, Inc. (NYSE:NOW) has increased sales hiring and boasts a strong pipeline, which, according to the analyst, strategically positions it for the second half of the year and sets it up for continued growth.\nServiceNow, Inc. (NYSE:NOW) offers an AI platform for business transformation, boosting productivity and maximizing business outcomes. Its intelligent platform, Now Platform, provides end-to-end workflow automation for digital businesses. Now Platform functions as a cloud-based solution embedded with AI and ML.\nWhile we acknowledge the potential of NOW as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the\nbest short-term AI stock\n.\nREAD NEXT:\n30 Stocks That Should Double in 3 Years\nand\n11 Hidden AI Stocks to Buy Right Now\n.\nDisclosure: None. This article is originally published at\nInsider Monkey\n.",
  "read_time": 2
}