{
  "title": "Wall Street's plans for stablecoin, from Goldman to JPMorgan",
  "link": "https://finance.yahoo.com/news/wall-streets-plans-stablecoin-goldman-170001740.html",
  "published": "2025-07-19T17:00:01Z",
  "body": "AP\nThe GENIUS Act, aimed at regulating digital currency, could allow banks to issue stablecoins.\nBank CEOs discussed launching stablecoin products during second-quarter earnings calls this week.\nHere's what Wall Street leaders like Jamie Dimon and Jane Fraser said about their firms' strategies.\nStablecoin is officially entering the chat. Literally.\nA few years ago, cryptocurrency was a left-field niche that much of white-collar Wall Street avoided like the plague. Now, banks are racing to catch up. During\nsecond-quarter earnings\ncalls, executives at five of the six largest US banks said they've either launched stablecoin products or have plans to do so.\nStablecoin came up because Congress had just\npassed the GENIUS Act\n, the first federal law regulating digital currency. President Trump signed the bill into law on Friday, opening the door for traditional banks to issue stablecoin, which is a dollar-linked digital token that can be used to transfer money and make payments.\nThe fact that leaders like\nJamie Dimon\nand\nJane Fraser\nare talking about it with analysts signals to regulators that big banks are ready to embrace the tech — and reassures investors that CEOs are paying attention to potential cash-cow innovations.\nSome might say banks have little choice. Stablecoins enable people to move money without a bank or a money transfer — threatening a core bank function. As Dimon said on JPMorgan's earnings call: \"I don't know why you'd want a stablecoin as opposed to just payment.\"\nBI compiled remarks on stablecoin from the earnings calls of Goldman Sachs, Morgan Stanley, JPMorgan, Bank of America, and Citi this week, including their respective plans around it. The thoughts expressed came after Congress passed the GENIUS Act but before the president signed it into law.\nJamie Dimon, CEO of JPMorgan\nAP Photo/Alex Brandon\nJamie Dimon, JPMorgan\nDimon signaled JPMorgan wants to be involved, but also expressed slight skepticism. The bank launched last month what they call \"\nJPMD\n,\" a type of deposit token.\n\"So, deposit token is effectively the same thing. You're moving money by token, you can pay interest. It's JPMorgan Deposit,\" he said.\nHe quickly added that the bank will do both. \"We're going to be involved in both JPMorgan Deposit coin and stablecoins to understand it, to be good at it.\"\n\"These guys are very smart,\" he said, referring to the fintech creators. \"They're trying to figure out a way to create bank accounts and get into payment systems and rewards programs. And we have to be cognizant of that. The way to be cognizant is to be involved.\"\nStory Continues\nJane Fraser, CEO of Citigroup\nAP Photo/Jacquelyn Martin\nJane Fraser, Citigroup\nCiti's Jane Fraser seemed the most enthusiastic and touted that they're already live with \"Citi Token Services\" in four markets.She indicated the bank's intention to be a leader in cross-border, real-time payments.\n\"As a leading global bank in this space, we are laser-focused on innovations, which enable clients to access real-time 24/7 payments, clearing and settlement across borders and across currencies,\" she said.\n\"We are looking at the issuance of a Citi stablecoin. But probably most importantly is the tokenized deposit space, where we're very active,\" she said, adding, \"This is a good opportunity for us.\"\nDavid Solomon, Goldman Sachs\nAP Photo/Alex Brandon\nDavid Solomon, Goldman Sachs\nCEO David Solomon said that Goldman has deployed employees to think through how they'll implement stablecoin, but didn't have an answer on what the company's product might look like.\n\"We've got a very significant group of people at the firm that are really deeply focused on watching the evolution of this,\" he said, adding that the firm sees opportunities around funding and the easing of financial transactions.\n\"It's early to say specifically where we're going to invest and exactly how this will play out, but we'll continue to keep you posted,\" he said, adding that there's \"a heightened level of focus here inside the firm.\"\nBrian Moynihan\nAP Photo/Seth Wenig\nBrian Moynihan, Bank of America\nBrian Moyihan, BofA's CEO, was more cautious in tone. He said the bank is preparing for stablecoin demand but awaiting clear legal guidance before moving further.\n\"We're still trying to figure out how big or small it is,\" he said, adding \"We're not seeing clients knocking on our door and saying, 'Please give me this right now.'\"\nHe said the bank has \"partnerships\" with stablecoin firms. \"It will be a complex array — and hopefully not complex to the customer, frankly.\"\nMorgan Stanley CEO Ted Pick\nJeenah Moon / Reuters\nSharon Yeshaya, Morgan Stanley\nMorgan Stanley's CFO, Sharon Yeshaya, said the bank is evaluating the stablecoin space and that there is no active deployment or public-facing product yet. Their approach is cautious and observational right now.\n\"We're actively discussing it. We're looking both at the landscape and the uses and the potential uses for our own client base,\" the CFO Sharon Yeshay said in the call. \"But it really is a little early to tell, especially for the businesses that we run versus businesses that you might see from competitors on how stablecoin would necessarily play in.\"\nRead the original article on\nBusiness Insider",
  "read_time": 4
}