{
  "title": "2 Top Quantum Computing Stocks to Buy in July",
  "link": "https://finance.yahoo.com/news/2-top-quantum-computing-stocks-162000930.html",
  "published": "2025-07-20T16:20:00Z",
  "body": "In This Article:\nIONQ\nIBM\nKey Points\nIonQ is far from profitability, but its trapped-ion technology is unique among quantum computing companies.\nIBM has released several powerful quantum computers and plans to invest $30 billion in its quantum program.\n10 stocks we like better than IonQ ›\nQuantum computing could be the next area of explosive growth in the tech sector. The consultants at McKinsey Digital have estimated that the industry could be worth as much as $1.3 billion by 2035, though there's a lot of uncertainty.\nIf that huge number becomes reality, successful quantum computing companies are going to make their investors very happy. Here are two picks to consider buying this month.\nImage source: Getty Images.\nIonQ is a high-risk, high-reward company\nQuantum physics experts Christopher Monroe and Jungsang Kim started\nIonQ\n(NYSE: IONQ)\nin 2015. Six years later, it became the first pure-play\nquantum computing\ncompany to go public.\nSince the technology is still in the early stages, and it's IonQ's only business, the company isn't profitable yet. Its revenue nearly doubled to $43.1 million last year, but its costs also increased, leading to a net loss of $331.6 million.\nProfitability is likely still several years away. CEO Peter Chapman believes it will happen by 2030 and is projecting sales near $1 billion at that point. Fortunately, IonQ has a strong balance sheet and recently sold $1 billion in common stock, giving it nearly $1.7 billion in cash and equivalents it can tap.\nWhat makes IonQ unique compared to other quantum computing companies is its trapped-ion technology. These computers store data using quantum bits, or qubits for short. The most widely used quantum computing method is superconducting qubits. IonQ's computers use trapped ions that are controlled with precise laser pulses.\nTrapped-ion technology has a few notable advantages. It delivers high fidelity, a term that refers to the accuracy of a quantum computer. One of the major quantum computing challenges is eliminating errors. No company has solved this yet, but IonQ achieved a significant breakthrough in September 2024, when it reported it had the first trapped-ion quantum system to surpass 99.9% fidelity.\nTrapped-ion qubits also have longer coherence times. Qubits decay over time and lose their quantum properties. Coherence time refers to the amount of time a qubit can maintain its quantum state. With solid-state quantum computing systems, coherence time is normally measured in microseconds to milliseconds. Trapped-ion systems measure coherence time in seconds to minutes, so it's a sizable difference.\nStory Continues\nThis doesn't necessarily mean that IonQ has the best quantum computing method; if so, everyone would be using trapped ions. But it has something different that delivers extremely low error rates. It has also picked up several high-profile contracts, including multiple deals with the U.S. Air Force Research Lab and one with the Department of Defense, making it worth a look for investors.\nIBM is a pioneer in quantum computing\nCloud services, software, and artificial intelligence (AI) may be the\ncore businesses of\nInternational Business Machines\n(NYSE: IBM)\n, but the company also has a long history with quantum computing. It started developing quantum computers over 30 years ago and has been responsible for notable advancements.\nIt released IBM Eagle, the first processor to surpass 100 qubits, in 2021. Its IBM Condor is currently the second-largest quantum computer in the world as measured by qubits.\nThe company has released a quantum development road map with ambitious milestones. It plans to demonstrate an example of quantum advantage in 2026, which refers to a quantum computer solving a problem faster than any classical computer can. By 2029, it plans to develop Quantum Starling, a fault-tolerant quantum computer -- one that can operate even in the presence of errors.\nBecause of its size and financial strength, the company can invest much more in quantum computing than a start-up like IonQ can. In April, it announced plans to spend $30 billion on the technology and mainframes as part of a five-year, $150 billion pledge to invest in U.S. computer manufacturing.\nIBM reported $14.5 billion in revenue and $8 billion in gross profit for the first quarter of 2025, both slight improvements year over year. Its increase in gross profit margin was more impressive, from 53.5% to 55.2%. The tech company ended the quarter with $17.6 billion in cash and cash equivalents, so it's well equipped to continue building its quantum computing program.\nIts share price has already jumped 29% this year, so it has gotten more expensive. However, it trades at less than 27 times adjusted forward earnings estimates, a reasonable valuation.\nQuantum computing investments are still speculative. We don't know when or if such machines will become widely used. With that kind of uncertainty, it wouldn't be wise to bet the farm on quantum computing, but you may want to add some exposure by picking up shares of IonQ, IBM, or both.\nShould you invest $1,000 in IonQ right now?\nBefore you buy stock in IonQ, consider this:\nThe\nMotley Fool Stock Advisor\nanalyst team just identified what they believe are the\n10 best stocks\nfor investors to buy now… and IonQ wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when\nNetflix\nmade this list on December 17, 2004... if you invested $1,000 at the time of our recommendation,\nyou’d have $652,133\n!* Or when\nNvidia\nmade this list on April 15, 2005... if you invested $1,000 at the time of our recommendation,\nyou’d have $1,056,790\n!*\nNow, it’s worth noting\nStock Advisor’s\ntotal average return is 1,048\n% — a market-crushing outperformance compared to 180% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join\nStock Advisor\n.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2025\nLyle Daly\nhas no position in any of the stocks mentioned. The Motley Fool has positions in and recommends International Business Machines. The Motley Fool has a\ndisclosure policy\n.\n2 Top Quantum Computing Stocks to Buy in July\nwas originally published by The Motley Fool",
  "read_time": 5
}