{
  "title": "A self-made millionaire explains how to make money in an 'exponential way': Use one-to-infinity leverage",
  "link": "https://finance.yahoo.com/news/self-made-millionaire-explains-money-174502012.html",
  "published": "2025-07-20T17:45:02Z",
  "body": "Rose Han is a YouTuber and money educator.\nCourtesy of Rose Han\nRose Han paid off six figures in debt before building a seven-figure net worth.\nHer income escalated when she built a business that tapped into \"one-to-infinity\" leverage.\nIt starts with asking yourself what value you can provide, Han says.\nRose Han, like many, learned to earn money linearly — hour by hour, paycheck by paycheck.\nFor years, she traded her time for money in her corporate job. She made good money, enough to start tackling her\nsix-figure student-loan debt\nand invest in the stock market. But it wasn't until she tapped into the idea of \"leveraged income\" that her income soared and pushed her net worth over the seven-figure mark.\n\"That's a completely different mentality that we don't learn in school,\" but it's a powerful one, Han, who runs a\nfinancial literacy company\n, told Business Insider. \"Leverage is the explanation behind any significant wealth creation, no matter who you look at,\" she said.\nDifferent levels of leverage and why you want 'one-to-infinity'\nTo break down the concept of leveraged income, Han uses the example of a fitness trainer.\nShe explained that if they're working one-on-one with a client, there's no leverage: \"You show up, trade hours for dollars, and you get paid.\"\nBut if they start a group fitness class and can train multiple clients at once, that's what she calls \"one-to-many leverage,\" and their earnings go up without having to work more hours. \"Now they're serving 10 people at once and therefore making about 10 times more,\" she said.\nThe final level, \"one-to-infinity leverage,\" can create life-changing wealth. This is when the trainer builds an app with weekly workouts and a meal plan feature, for example.\n\"They could create that app once, and millions of people around the world can subscribe,\" Han said. \"That concept really was the key that I unlocked.\"\nHan lives in Los Angeles.\nCourtesy of Rose Han\nShe didn't get to one-to-infinity leverage overnight.\nHer business began in the basement of a coworking space, where she hosted free personal finance classes based on her own experience paying down debt and using index funds to grow her net worth.\n\"I was just learning a lot on my financial awakening journey, so I wanted to share it,\" she said. \"In the back of my mind, I thought, 'OK, maybe there's some way I could make this lucrative,' but that's not the goal.\"\nShe hosted free classes for nearly two years, until she gained the confidence to start charging. Then, instead of keeping the class within the coworking space, she decided to move to YouTube, where her reach would be far greater.\nStory Continues\n\"The idea that a video could reach millions of people, 24/7, for the rest of my life and even after, that was really just wild to me,\" Han said. \"I was skeptical because I'd never gone on camera. It was scary. But, after about a year and a half of doing these free meetups, I got the courage to press record and post my first video.\"\nHer\nYouTube channel\n, which has nearly one million subscribers, has evolved into a financial education company that earns money through online courses, brand deals, affiliate links, and book sales.\nShe launched her first online course in 2020.\nIt brought in $160,000 \"in a matter of days,\" she said. \"I made in seven days what used to take me an entire year to make. Granted, I worked a lot to create that course, and it didn't just happen in seven days, but I created something once that I could sell over and over and over and serve a lot of people. I created a lot of value with something, and so I got paid in that exponential way.\"\nHow to apply the one-to-infinity mindset\nTo use the one-to-infinity model and earn exponentially, start by asking: What value can I provide?\n\"I fully believe that the more value you provide, the more you can earn,\" Han said. \"And, if you think creatively enough, there's no limit to how much value you can provide and therefore how much money you can earn.\"\nThe big holdup for her was confidence, and convincing herself that she was providing something valuable enough to get paid for.\n\"I think this is the challenge for most people. They think: 'Oh, I should make more money. I need to ask for a raise and get a higher-paying career.' But their first obstacle is thinking, 'Who am I to do that? I don't have the skills. I don't have anything of value to provide.' That sort of mindset of, 'I'm not capable.'\"\nHan overcame that mindset by taking action — by hosting the free meetups and getting real-world feedback that her money lessons were helping people.\n\"Know that you have the ability within you to create a lot of value for the world and therefore generate a lot of money that's like within your control,\" she said. \"You just have to find the confidence.\"\nRead the original article on\nBusiness Insider",
  "read_time": 4
}