{
  "title": "Analyst Says Amazon.com (AMZN) Cloud Business Needs to Show ‘Acceleration’ for Stock Outperformance",
  "link": "https://finance.yahoo.com/news/analyst-says-amazon-com-amzn-203741311.html",
  "published": "2025-07-20T20:37:41Z",
  "body": "In This Article:\nAMZN\nAmazon.com Inc (NASDAQ:AMZN) is one of the\n10 Buzzing Stocks to Watch as AI Trade Makes a Comeback\ns\n.\nMark Mahaney, head of internet research at Evercore ISI, recently said Amazon needs to show further AWS growth for stock outperformance.\n“The retail business is important for Amazon.com Inc (NASDAQ:AMZN). It’s a necessary condition. I think for the stock to really outperform though, it will be the cloud business. You need to see acceleration in that in the back half of the year. I think we’re going to see that. If we’re wrong on that, the stock’s not going to outperform from here. The retail business also needs to show this continued expansion in margins. And you know the—I know we’ve sort of waxed off and on and now we’re off about tariff risk, but it’s still there and you know, Amazon.com Inc (NASDAQ:AMZN) need—and Amazon’s kind of the canary in the coal mine. Shoot, they may be the whole coal mine. I mean they’re going to give us a read into, and we’re going to be tracking pricing, for prices on products on Amazon.com Inc (NASDAQ:AMZN) and, you know, not these four days but as we go through the back half of the year and, you know, there is risk here.”\nAWS revenue jumped 16.9% year over year in the last reported quarter, while its operating income rose 22.6%. AWS has now surpassed a $100 billion annual run rate, playing a central role in helping businesses modernize infrastructure, reduce costs, and accelerate innovation.\nAnalyst Says Amazon.COM (AMZN) Cloud Business Needs to Show ‘Acceleration’ for Stock Outperformance\nTtatty / Shutterstock.com\nThe market often overlooks Amazon’s ads business, which is generating more than $10 billion in quarterly revenue despite being built from scratch. In the first quarter, ad revenue rose 19% from a year earlier to $13.9 billion, continuing to support overall profitability.\nAccording to some Wall Street estimates, Amazon is projected to earn $6.20 per share in 2025 and $8.95 in 2027, reflecting 44.4% earnings growth over two years.\nLakehouse Global Growth Fund stated the following regarding Amazon.com, Inc. (NASDAQ:AMZN) in its\nMay 2025 investor letter\n:\n“Amazon.com, Inc\n. (NASDAQ:AMZN) reported a solid quarterly result with net sales up 9% year-on-year (10% in constant currency terms) to $155.7 billion and operating profit up 20% to $18.4 billion. The company’s core e-commerce business remained resilient in the face of potential tariffs, with management noting they hadn’t seen any material change in consumer buying behaviour as at the end of April. Amazon web services (AWS) grew 17% to $29.3 billion which was a slight deceleration from the 19% delivered last quarter. Whilst this seems disappointing at first blush, management reiterated that demand is very strong they are still capacity constrained. Artificial intelligence (AI) continues to be a key growth driver with AI workloads growing in excess of 100% year-on-year on AWS. Overall, it was a positive result, and we remain confident that the company is set to deliver many years of solid revenue growth and margin expansion.”\nStory Continues\nWhile we acknowledge the potential of AMZN as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on the\nbest short-term AI stock\n.\nREAD NEXT:\n30 Stocks That Should Double in 3 Years\nand\n11 Hidden AI Stocks to Buy Right Now\n.\nDisclosure: None. This article is originally published at\nInsider Monkey\n.",
  "read_time": 3
}