{
  "title": "Big food companies undergo 'self reflection' on business future as deals sweep the sector",
  "link": "https://finance.yahoo.com/news/big-food-companies-undergo-self-reflection-on-business-future-as-deals-sweep-the-sector-150004021.html",
  "published": "2025-07-19T15:00:04Z",
  "body": "In This Article:\nKHC\nPEP\nK\nKLG\nKO\nBig food companies are facing big questions about their futures.\nBetween a potential breakup at Kraft Heinz (\nKHC\n), a\nmultibillion-dollar deal\nbetween Ferrero and WK Kellogg (\nKLG\n), and PepsiCo's (\nPEP\n)\nacquisition\nof soda brand Poppi, big food brands are taking a hard look at their US portfolios as consumer tastes shift, growth stalls, and regulatory pressure over products continues.\n\"The self-reflection is building,\" Mizuho analyst John Baumgartner told Yahoo Finance last week, \"there's a lot of flux in the industry right now.\"\n\"This has typically been a pretty sleepy sector, and to be hit with all of these headwinds or uncertainties and have it happen all at the same time... does really cause reason for pause and reflection on the business ... [and] what the trends are going forward,\" Baumgartner added.\nJust this week, PepsiCo posted a 2% volume decline in its North America beverage business in the second quarter, a drop that follows 1% and 3% declines in the prior two quarters, respectively.\nThe same day, Coca-Cola (\nKO\n) faced a\nnew political hurdle\nwhen President Trump posted to social media that the company would begin using real cane sugar in its US sodas. In a statement, the company said it appreciated Trump's enthusiasm for the brand. Coca-Cola will report quarterly earnings on Tuesday morning.\nA Mexican Coke beverage is displayed in an ice-cooler at a park on July 17, 2025, in Austin, Texas. (Brandon Bell/Getty Images)\n·\nBrandon Bell via Getty Images\n'Their core businesses are not performing'\nIn many industries facing uncertain growth trajectories, the options for executives can become simple: buy or sell.\nThis year, PepsiCo announced a $1.95 billion deal for soda brand Poppi and a $1.2 billion deal for Siete Foods. Hershey (\nHSY\n)\nacquired popcorn brand Lesser Evil\n.\n\"It's a bit reactive,\" Bank of America analyst Peter Galbo said. \"These companies are observing that their core businesses are not performing the way that they thought they would.\"\nAnd in Galbo's view, this year's actions show companies saying to themselves that if the core business won't work, \"I have to buy something that is going to augment the core.\"\nConnor Rattigan, an analyst at Consumer Edge Research, said most of these deals are for \"higher growth smaller brands that tend to be indexed to ... thematic trends in the industry,\" whether that's health, flavor, or packaging.\nOn the flip side, other big companies have seen this environment as offering an opportunity to break up a large enterprise.\nNearly two years after\nKellogg split into two companies\n, WK Kellogg and Kellanova (\nK\n), both have been scooped up by private players.\nStory Continues\nKellanova, which houses snack brands like Pop-Tarts and Cheez-Its, is set to be acquired by Mars Candy for close to $36 billion, pending European Union regulatory approval. Last week,\nFerrero said it would buy WK Kellogg,\nthe company behind Frosted Flakes and Froot Loops, for $3.1 billion.\n\"There has been pressure from activist investors, or just larger investors, that are maybe growing tired of a stagnant share price and are looking for opportunities to drum up appreciation in that regard,\" Morningstar analyst Erin Lash said.\nTD Cowen analyst Robert Moskow wrote in a recent note that investors have realized a roughly 40% gain since Kellogg broke up. Consumer Staples (\nXLP\n) stocks have dropped about 6% over that same period.\nAnd Kraft Heinz could\nreportedly\nbe next in line for a breakup.\nBank of America's Galbo sees the split putting Kraft Heinz's Taste Elevation platform, mostly condiments like Heinz ketchup and Philadelphia cream cheese, in one company, with its grocery brands like Kraft, Oscar Mayer, Lunchables, and Capri-Sun in another business.\nSince H.J. Heinz Company and Kraft\nmerged\n10 years ago, shares of the combined company have gone down more than 65%.\nKraft Mac & Cheese products are seen on a shelf at a Target store on November 15, 2024. (Photo by Michael M. Santiago/Getty Images)\n·\nMichael M. Santiago via Getty Images\nBrooke DiPalma is a senior reporter for Yahoo Finance. Follow her on X at @\nBrookeDiPalma\nor email her at bdipalma@yahoofinance.com.\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\nRead the latest financial and business news from Yahoo Finance",
  "read_time": 3
}