{
  "title": "BofA Trims McDonald’s (MCD) Price Target, Maintains Neutral Rating",
  "link": "https://finance.yahoo.com/news/bofa-trims-mcdonald-mcd-price-035956544.html",
  "published": "2025-07-21T03:59:56Z",
  "body": "In This Article:\nMCD\nMcDonald’s Corporation (NYSE:\nMCD\n) is one of the\nmost profitable consumer stocks to buy now\n. Bank of America slightly lowered its price target on McDonald’s Corporation (NYSE:MCD) to $322 from $327 while keeping a\nNeutral\nrating, as it fine-tunes estimates across its restaurant coverage ahead of the sector’s upcoming earnings season. The revised target implies an upside of roughly 8.4% from the current market price of $297.\nBofA Trims McDonald's (MCD) Price Target, Maintains Neutral Rating\nsaknakorn / Shutterstock.com\nThe move reflects a broader recalibration by BofA analysts, who are adjusting their models to account for changes in market multiples and company-specific revisions. While McDonald’s remains a stable performer, the firm signaled that valuation has grown less compelling in the short term, especially amid a backdrop of slowing same-store sales growth and cautious consumer trends in key international markets.\nBofA highlighted that while McDonald’s continues to benefit from scale, operational efficiency, and strong brand equity, macro pressures, including FX headwinds and uneven traffic in Europe, could limit near-term upside. Still, the modest price cut is not a sign of deteriorating fundamentals but rather part of a broader sector-level housekeeping.\nInvestors will be closely monitoring McDonald’s quarterly update for guidance on pricing strategies, traffic trends, and progress in digital engagement, all of which will shape sentiment heading into the second half of the year.\nWhile we acknowledge the potential of MCD as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the\nbest short-term AI stock\n.\nREAD NEXT:\nTop 10 Healthcare AI Stocks to Buy According to Hedge Funds\nand\n10 Best Industrial Automation Stocks to Buy for the Next Decade\nDisclosure: None.",
  "read_time": 2
}