{
  "title": "Ethereum's ETH Breaks $3,800 Amid Massive Whale Buy, Large Capital Inflow",
  "link": "https://finance.yahoo.com/news/ethereums-eth-breaks-3-800-170114052.html",
  "published": "2025-07-20T17:01:14Z",
  "body": "In This Article:\nETH-USD\nEthereum's ether (ETH) rose nearly 6% during the past 24-hour period, rising above $3,800, outperforming the CoinDesk 20 Index, a broader gauge of the digital assets market.\nThe move comes as major financial institutions and treasury companies have started to pour capital into the digital asset, while Wall Street's heavyweights are starting to pay attention to ETH. Most recently, U.S.-listed spot ether ETFs saw\nrecord inflows\nof $2.18 billion over the past week, which was dubbed as \"crypto week\" as major\ncrypto legislation\nwas passed by the regulators.\nThe rally also coincides with some whales moving a massive amount of ETH on-chain over the weekend. According to on-chain analyst EmberCN, over the weekend, one ETH whale seems to have accumulated around\n$50 million\nof the token, at an average price of $3,714.\nMeanwhile, some analysts are expecting ETH prices to surge much higher than current levels. Most recently, Tom Lee, the head of research at Fundstrat, CIO of Fundstrat Capital, and Chairman of Bitmine Immersion Technologies (BMNR), cited various analyses and said that the\nprice could reach\nas high as $15,000.\nBefore hitting the $3,800 levels, ETH traded within a $255.34 range between a session low of $3,534.57 and a high of $3,789.92 in the last 24 hours, representing 7.22% volatility, according to CoinDesk Research's technical analysis data.\nKey resistance levels formed at $3,760-$3,790, where trading activity consolidated following multiple upward attempts. The model showed that large buying support seems to have emerged around $3,590-$3,610 during early trading hours as transaction volumes surpassed the 24-hour average of 215,432 units.\nThis consistent upward momentum with successive higher lows potentially indicates ongoing institutional capital allocation, positioning ETH for a possible rally beyond current resistance thresholds.\nDisclaimer:\nParts of this article were generated with the assistance from AI tools and reviewed by our editorial team to ensure accuracy and adherence to\nour standards\n. For more information, see\nCoinDesk's full AI Policy\n.",
  "read_time": 2
}