{
  "title": "Former Tesla president discloses the secret to scaling a company",
  "link": "https://finance.yahoo.com/news/former-tesla-president-discloses-secret-180000250.html",
  "published": "2025-07-20T18:00:00Z",
  "body": "In This Article:\nTSLA\nLYFT\nImage Credits:PM Images / Getty Images\nFew companies have grown as quickly as Tesla, especially just before and after the company launched the Model 3, its first affordable EV.\n“We scaled Tesla in 30 months from $2 billion in revenue to $20 billion in revenue,” Jon McNeill, the former president of Tesla who is now co-founder and CEO of DVx Ventures, told the crowd at TechCrunch’s All Stage event in Boston.\nIt wasn’t McNeill’s first time scaling companies, nor would it be his last. Previously, he founded six different companies, and after Tesla, he joined Lyft as COO before starting his own venture firm, where he’s launched a dozen startups.\nOver the years, McNeill has developed a playbook that helps him identify when a company is ripe for scaling. He shared those insights last week with the audience at\nTechCrunch All Stage 2025\n.\nWhen assessing a company’s potential to scale, McNeill primarily judges them on two different measures: product-market fit and go-to-market fit. It’s not unusual for investors to focus on those concepts, but McNeill has distilled them into two objective measures.\nFor product-market fit, he asks each startup, “Do 40% of your customers say they cannot live without your product?” he said. If not, then the company isn’t ready.\n“We keep adding, adding, adding and tweaking the product until we get to 40% and then we say, okay, boom, now we’ve got product-market fit,” McNeill said. “It’s actually objective and measured. It’s not a feeling; it’s not a sense. It’s a metric.”\nMcNeill added, “We did a study of businesses that actually achieved breakout, and those businesses achieved breakout at roughly that 40% acceptance level.”\nSecond, McNeill looks at whether the company has a mature go-to-market strategy. Specifically, he’s interested in whether the amount a company spends to acquire customers, known as customer acquisition cost (CAC), is sufficiently below the total lifetime value (LTV) that the customer will bring the company.\nWhen a company starts pulling in four times more money over the life of the customer than it spent to acquire them — an LTV to CAC ratio of four-to-one — that’s when he knows the company is ready.\n“Then we pour in the cash. But before then, we’re doling out cash $100,000 at a time just to get to different stage gates,” he said.",
  "read_time": 2
}