{
  "title": "Goldman Sachs Raises Philip Morris (PM) Price Target, Maintains Buy Rating",
  "link": "https://finance.yahoo.com/news/goldman-sachs-raises-philip-morris-040126561.html",
  "published": "2025-07-21T04:01:26Z",
  "body": "In This Article:\nPM\nPhilip Morris International (NYSE:\nPM\n) is one of the\nmost profitable consumer stocks to buy now\n. Goldman Sachs raised its price target on Philip Morris International (NYSE:PM) to $200 from $190 on July 17, maintaining a\nBuy\nrating and signaling confidence in the tobacco giant’s earnings trajectory. The new target implies an upside of nearly 12% from the current share price of $178.70.\nGoldman Sachs Raises Philip Morris (PM)) Price Target, Maintains Buy Rating\nCopyright:\njetcityimage / 123RF Stock Photo\nThe upward revision comes ahead of the company’s next earnings release, with Goldman pointing to improved operational visibility and strong execution in key international markets. Analysts highlighted the company’s ability to navigate shifting regulatory environments while preserving margins through disciplined cost controls and a balanced pricing strategy.\nPhilip Morris has also continued to expand its presence in non-combustible products, though Goldman’s update did not place sole emphasis on this segment. Instead, the note referenced broad-based strength in the company’s global footprint, where consistent performance in both developed and emerging markets has helped support top-line growth.\nInvestors will be watching closely for commentary on shipment volumes, inventory trends, and guidance updates. With shares hovering near their recent highs, Goldman’s call suggests confidence that Philip Morris still has room to move higher as it balances legacy operations with ongoing product innovation.\nWhile we acknowledge the potential of PM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the\nbest short-term AI stock\n.\nREAD NEXT:\nTop 10 Healthcare AI Stocks to Buy According to Hedge Funds\nand\n10 Best Industrial Automation Stocks to Buy for the Next Decade\nDisclosure: None.",
  "read_time": 2
}