{
  "title": "How Elon Musk Caused This Squirrel Memecoin To Spike With An Epstein Rant",
  "link": "https://finance.yahoo.com/news/elon-musk-caused-squirrel-memecoin-163152376.html",
  "published": "2025-07-20T16:31:52Z",
  "body": "In This Article:\nTSLA\nSOL-USD\nBenzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nTesla (NASDAQ:\nTSLA\n) CEO\nElon Musk\nis once again sending ripples through the cryptocurrency market with his tweets.\nThe billionaire has sent\nPeanut the Squirrel\n, a Solana memecoin inspired by a pet squirrel, which went viral after it was euthanized by the state of New York, soaring with a Tuesday rant. The rant came in response to the government’s continued failure to release the alleged \"Epstein list.\"\nThe Epstein list is a purported compilation of famous persons who were co-conspirators in Epstein’s sex crimes in the custody of the government, per conspiracy theorists.\nDon't Miss:\nTrade crypto futures on Plus500 with up to $200 in bonuses\n— no wallets, just price speculation and free paper trading to practice different strategies.\nGrow your IRA or 401(k) with Crypto –\nunlock the power of alternative investments including a Crypto IRA within your retirement account\n.\n\"They arrested (and killed) Peanut, but have not even tried to file charges against anyone on the Epstein client list,\" Musk\nsaid\non X. \"Government is deeply broken.\"\nThe remark was accompanied by a \"The Office\" meme that expanded on these views.\n\"More squirrels and raccoons have been arrested than anyone on Epstein’s client list,\" the caption read.\nWithin minutes of Musk’s post, PNUT’s price spiked by 5% from $0.22 to $0.23. The token’s trading volume also surged about 100% from around $100 million to over $200 million. At last look, the token is trading at $0.24, continuing the Musk-led rally after a brief correction.\nTrending: New to crypto?\nGet up to $400 in rewards for successfully completing short educational courses and making your first qualifying trade\non Coinbase.\nRecurring Antics\nThe PNUT rally is the latest in a long line of incidents where Musk’s online antics have sparked speculative cryptocurrency activity. In May, Musk changed his profile name to \"gorklon rust,\" a mashup of references parodying xAI’s Grok chatbot, while also changing his profile picture to funkier version of Grok’s profile picture,\nsparking significant rallies\nin \"Gork”-themed memecoins.\nBefore gorklon rust, it was \"\nHarry Bōlz\n,\" in February, in a juvenile attempt to get mainstream news anchors to say the name out loud. In late December and early January, it was \"Kekius Maximus.\"\nBut Musk is perhaps best known for\nhis advocacy of Dogecoin\n. The memecoin’s 15,500% run to its all-time high of $0.73 in 2021 is widely attributed to his vocal support.\nStory Continues\nSee Also:\nA must-have for all crypto enthusiasts:\nSign up for the Gemini Credit Card today and earn rewards on Bitcoin Ether, or 60+ other tokens, with every purchase\n.\nMarket Manipulation Concerns\nMusk’s antics have sparked market manipulation concerns over the years, as resulting market rallies are often followed by equally violent market crashes.\nAnd in 2022, a group of investors attempted to cash in on these concerns,\nfiling a lawsuit\nagainst Musk and Tesla that alleged that they had manipulated the price of Dogecoin for their profit. But a federal judge\ndismissed the lawsuit\nin 2024, ruling that Musk’s statements supporting the memecoin were \"aspirational and puffery, not factual,\" adding that “no reasonable investor could rely upon them.”\nMusk, for his part,\nhas said\npeople should only invest in memecoins for fun, likening it to a casino.\n\"It’s like a casino,\" he said in a February episode of the \"Joe Rogan Experience\" podcast. \"If you expect to win in a casino, you are being a fool. So if you expect to win at memecoins, you are being foolish. You are not going to win at memecoins. Don’t sink your life savings into a memecoin.\"\nRead Next:\nWarren Buffett once said, \"If you don't find a way to make money while you sleep, you will work until you die.\" Here’s\nhow you can earn passive income with just $10\n, starting today.\nImage: Shutterstock\nThis article\nHow Elon Musk Caused This Squirrel Memecoin To Spike With An Epstein Rant\noriginally appeared on\nBenzinga.com",
  "read_time": 3
}