{
  "title": "HSBC Raises Booking (BKNG) Price Target, Maintains Buy Rating",
  "link": "https://finance.yahoo.com/news/hsbc-raises-booking-bkng-price-040126027.html",
  "published": "2025-07-21T04:01:26Z",
  "body": "In This Article:\nBKNG\nBooking Holding Inc. (NASDAQ:\nBKNG\n) is one of the\nmost profitable consumer stocks to buy now\n. HSBC boosted its price target on Booking Holdings Inc. (NASDAQ:BKNG) to $7,069 from $6,120, reaffirming a\nBuy\nrating as the firm grows more confident in the travel giant’s ability to capitalize on sustained global demand. The new target implies an upside of about 24% from the current share price of $5,703.90.\nHSBC Raises Booking (BKNG) Price Target, Maintains Buy Rating\nA fast-paced travel agent making a bookings for a family vacation package.\nThe revision comes as Booking continues to benefit from strong international travel trends, particularly in Europe and Asia, where booking volumes and average daily rates have held firm. HSBC noted that the company’s mix of direct traffic, mobile penetration, and loyalty adoption positions it well to protect margins and drive repeat business.\nAnalysts also pointed to improving air travel trends and solid summer booking curves as supporting factors heading into the back half of the year. While currency fluctuations and geopolitical uncertainties remain background risks, Booking’s scale and diversified platform have helped it weather volatility better than many peers.\nInvestors will be looking closely at Booking’s upcoming results for updates on traveler behavior, cancellation trends, and regional performance. HSBC’s revised target suggests continued faith in the company’s execution as it navigates a complex but growing global travel landscape.\nWhile we acknowledge the potential of BKNG as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the\nbest short-term AI stock\n.\nREAD NEXT:\nTop 10 Healthcare AI Stocks to Buy According to Hedge Funds\nand\n10 Best Industrial Automation Stocks to Buy for the Next Decade\nDisclosure: None.",
  "read_time": 2
}