{
  "title": "Japan ruling party's election loss is in the price, investors say",
  "link": "https://finance.yahoo.com/news/japan-ruling-partys-election-loss-165014446.html",
  "published": "2025-07-20T16:50:14Z",
  "body": "In This Article:\nJPY=X\nBy Vidya Ranganathan\nSINGAPORE (Reuters) -Japan's upper house election on Sunday dealt a big blow to the ruling coalition and sets markets up for possible policy paralysis and a bigger fiscal deficit, much of which is already priced in, analysts said.\nThe nation's ruling coalition lost control of the upper house, further weakening Prime Minister Shigeru Ishiba's grip on power even as he vowed to remain party leader, citing a looming tariff deadline with the United States.\nJapanese markets were closed on Monday for a holiday, but the rise in the yen and Nikkei futures showed investors had already priced in the election outcome. The Japanese currency has weakened considerably this year on expectations of changes to taxes and a bigger fiscal deficit.\nThe election result, while not entirely a shock to markets, also comes at a tricky time for a country trying to get a tariff deal with U.S. President Donald Trump before an Aug. 1 deadline.\nJapanese government bonds (JGBs) plunged last week, sending yields on 30-year debt to an all-time high, while the yen slid to multi-month lows against the U.S. dollar and the euro.\n\"I will not chase the coalition loss trades, and I suspect participants will spend some time analysing the implications of the loss, which could take time to materialize, and also refocus attention to the trade negotiations which is another major macro risk for Japan,\" said Rong Ren Goh, a portfolio manager in the fixed income team at Eastspring Investments.\nInvestors expect it will be a while before it becomes clear whether the ruling coalition intends to continue as a minority government, or draw in a new partner.\nAmong the most likely candidates is the Democratic Party for the People (DPP), which has urged the Bank of Japan to reverse course and again loosen monetary policy. Investors are bracing for the LDP to compromise heavily to accommodate opposition parties' desire for tax cuts.\nIshiba's fate also remains an unknown, although he said on Sunday he intends to stay in his position.\nWithin the Liberal Democratic Party (LDP), a leading candidate to replace Ishiba, should he step down, is Abenomics proponent Sanae Takaichi, who has advocated for a resumption of monetary easing by the BOJ.\nAll three leading opposition parties back some form of consumption tax cuts, with the populist, right-wing Sanseito proposing a phase-out of VAT altogether.\nThose cuts would have to be paid for with increased Japanese government bond issuance. With debt about 2-1/2 times GDP, Japan is already the world's most indebted major country.\nStory Continues\nShoki Omori, chief desk strategist at Mizuho Securities in Japan, said in a note that he does not expect the LDP to force a leadership change, particularly while trade talks with the U.S. government are ongoing.\n\"Against that political backdrop, prospects for an aggressive fiscal stimulus are limited....A meaningful supplementary budget, if one emerges, would not be debated until the autumn Diet session at the earliest,\" he wrote.\nIf Ishiba resigns, the political uncertainty could be a trigger for foreign investors to sell Japanese shares and the yen, analysts said.\nBarclays analysts estimate a five percentage point cut to Japan's sales tax, currently at 10%, would lead to a 15-20 basis point increase in the 30-year yield.\nJapanese government 30-year yields are up 80 basis points (bps) this year and the yield curve is at its steepest in years, with the spread between 10-year and 30-year bonds above 150 bps.\nThe yen has had a volatile first half of 2025 in a range of 140-160 per dollar.\nIt rallied hard after the Bank of Japan's rate rise in January stoked expectations for a faster pace of monetary tightening, but has dithered since late April on political uncertainty, fractious tariff negotiations with the Donald Trump administration and the BOJ's dovishness.\nLong speculative positions in the yen are however still very large, making it likely that the currency will fall rapidly if Japan calls for a snap election or fiscal policy is loosened.\nThe Nikkei 225 benchmark, by contrast, is up more than 11% since April 2, when Trump unveiled his global tariffs.\n(Additional reporting by Rae Wee in Singapore and Kevin Buckland in Tokyo; Editing by Chizu Nomiyama)",
  "read_time": 4
}