{
  "title": "LSE plots 24-hour trading to revive interest in shares",
  "link": "https://finance.yahoo.com/news/lse-plots-24-hour-trading-172436362.html",
  "published": "2025-07-20T17:24:36Z",
  "body": "In This Article:\nBTC-USD\nHOOD\nShares on the London Stock Exchange currently only trade between 8am and 4.30pm - Hannah McKay/Reuters\nShares in UK-listed companies could be traded 24 hours a day under radical plans from the London Stock Exchange Group (LSEG) to tap into booming demand from night owl traders.\nThe LSEG, which owns the flagship London stock market, is accelerating plans to launch a 24-hour trading platform to\nboost the appeal of the gloomy UK market\nand encourage overseas investors and younger traders to buy British shares.\nChanging trading patterns in the US, where transactions are increasingly done outside of working hours by a\nnew generation of Gen Z retail investors on smartphone apps\n, is leaving traditional bourses exposed.\nCryptocurrency markets, such as Bitcoin trading, already trade around the clock and more people trade shares in the small hours on platforms like Robinhood, making traditional market hours increasingly anachronistic.\nLondon-listed shares currently only trade between 8am and 4.30pm.\nThe LSEG declined to comment on the plan, first reported by the Financial Times, but chief executive David Schwimmer has made no secret of his desire to boost the London market.\nMr Schwimmer has transformed LSEG into a data and technology giant to rival Bloomberg following a $27bn (£21bn) takeover of Refinitiv, with the stock exchange now accounting for just 3pc of the group’s revenues.\nChief executive David Schwimmer has made no secret of his desire to boost the London market - Chris J. Ratcliffe/Bloomberg\nBritain’s stock market is facing a crisis after shrinking trading volumes and a dearth of new listing. Recent tax raids by the Government and tariffs woes have also dented companies.\nAccording to figures released by EY on Monday, UK-listed companies issued 59 profit warnings during the second quarter of 2025, a 20pc rise compared to the same period last year.\nA shift to 24-hour trading would mirror strides in the US where so-called “dark pools” – which are private exchanges where buyers and sellers meet in secret – have become increasingly popular ways to trade shares overnight.\nSome dark pools, such as Blue Ocean, allow for shares to be traded once US markets close and last year the US Securities and Exchange Commission (SEC) approved a licence for a new Bermuda-based trading platform 24X to offer out-of-hours trading.\nMainstream US stock exchanges such as the New York Stock Exchange (NYSE) have sought to keep pace with the developments by extending trading hours.\nThe NYSE asked the SEC for permission to extend its trading window outside of its traditional 9:30am to 4pm time earlier this year.\nHowever any move to extend trading hours is likely to face fierce criticism from conventional fund managers. They use the closing price of shares to set the value of their funds, with trillions of pounds dependent on the closing price.\nStory Continues\nRound-the-clock trading would make setting prices even more difficult, while fund managers are likely to resist moves to monitor the market 24/7.\nBroaden your horizons with award-winning British journalism. Try The Telegraph free for 1 month with unlimited access to our award-winning website, exclusive app, money-saving offers and more.",
  "read_time": 3
}