{
  "title": "Morgan Stanley Raises Yum Brands (YUM) Price Target, Maintains Equal Weight Rating",
  "link": "https://finance.yahoo.com/news/morgan-stanley-raises-yum-brands-040004353.html",
  "published": "2025-07-21T04:00:04Z",
  "body": "In This Article:\nYUM\nYum! Brands, Inc. (NASDAQ:\nYUM\n) is one of the\nmost profitable consumer stocks to buy now\n. Yum! Brands (NYSE: YUM) got a lift this week after Morgan Stanley raised its price target on the stock to $153 from $151, reflecting cautious optimism around the company’s near-term outlook. The firm maintained its\nEqual Weight\nrating but pointed to improving industry conditions that could lead to a stronger Q2 for restaurant operators and food distributors.\nMorgan Stanley Raises Yum Brands (YUM) Price Target, Maintains Equal Weight Rating\nA chef in a kitchen preparing a fast food meal of chicken, pizza and burgers.\nWith Yum! Brands currently trading at around $149, the new price target suggests a modest upside of approximately 2.7%. While not a dramatic revision, the move signals confidence in the company’s ability to navigate a mixed macro environment. In a note to investors, the firm highlighted stabilizing input costs and healthy spending patterns among middle- and upper-income consumers, which continue to support dining out behavior despite persistent policy uncertainty.\nMorgan Stanley also noted that the broader restaurant space appears better positioned this quarter, as inflation pressures ease and discretionary spending remains intact in key consumer groups. For Yum!, that could translate into more consistent traffic and potentially stronger margins, particularly as it continues to focus on digital engagement, value menus, and international expansion.\nInvestors are now eyeing Yum!’s upcoming earnings report for confirmation that these trends are translating into tangible performance improvements, especially in high-margin segments like Taco Bell.\nWhile we acknowledge the potential of YUM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the\nbest short-term AI stock\n.\nREAD NEXT:\nTop 10 Healthcare AI Stocks to Buy According to Hedge Funds\nand\n10 Best Industrial Automation Stocks to Buy for the Next Decade\nDisclosure: None.",
  "read_time": 2
}