{
  "title": "SPACs Are Back - You Should Be Worried",
  "link": "https://finance.yahoo.com/news/spacs-back-worried-174108701.html",
  "published": "2025-07-20T17:41:08Z",
  "body": "In This Article:\nTSLA\nAMZN\nSell enter button by Mesh Cube via iStock\nSPACs aren’t new. Their rise and fall are a clear case of market memory loss. From 2020 to early 2021, special purpose acquisition companies exploded into the spotlight. Hundreds launched, raising over $160 billion. They were sold as a faster, more flexible alternative to IPOs, a way to take private companies public without the regulatory drag. But underneath the surface, most were hype machines. Celebrities joined the party. Shaquille O’Neal. Jay-Z. Even former House Speaker Paul Ryan. Their names were plastered on term sheets while pre-revenue companies were rushed into the market and pitched as the next Tesla or Amazon. Few investors stopped to ask the obvious: why were these companies avoiding the standard IPO route?\nBy late 2022, the bubble had burst. SPACs that once traded at premiums dropped below their $10 NAV floors. Goldman Sachs reported that 77% of post-merger SPACs from the 2020–2021 class traded below their issue price within a year. High-profile failures like Nikola and Lordstown Motors burned a lot of capital and credibility. These companies weren’t just struggling for scale or profits; some barely had functioning products. And yet, retail investors piled in, drawn by slick investor decks and the promise of early access.\nMore News from Barchart\nIt’s Never ‘Happened in the History of Tech to Any Company Before’: OpenAI’s Sam Altman Says ChatGPT is Growing at an Unprecedented Rate\nDitch ‘Basic’ Nvidia and Buy This ‘Unique’ Chip Stock Instead\nTesla Earnings, Powell Speech and Other Can't Miss Items this Week\nTired of missing midday reversals? The FREE Barchart Brief newsletter keeps you in the know. Sign up now!\nNow, SPACs are making a quiet comeback. Deal volumes are creeping up again. Promoters are talking about \"next-gen\" structures and stronger governance. But underneath, little has changed. A SPAC is only as good as the business it merges with. Most of the time, it still ends in disappointment.\nWhy They Took Off Last Time And Why They Failed\nThe SPAC craze had nothing to do with sound investing. It was hype from the start. Retail investors, riding stimulus checks and fresh off big pandemic gains, were desperate to jump into the next big thing. SPACs gave them what looked like front-row access. Unlike traditional IPOs, where institutions get first pick, anyone could buy into a SPAC at $10. Wall Street sponsors knew how to frame the story. They pitched SPACs as democratized dealmaking. But they buried the fine print, loaded fees, generous promoter shares, and exit strategies that let them cash out long before the retail crowd knew what they owned.\nStory Continues\nThe real problem wasn’t access. It was the quality of the business. Many weren’t just unprofitable; they had no revenue at all. Take Nikola, which reached a multi-billion-dollar valuation based on a prototype that didn’t work. Or Clover Health, which marketed itself as a tech-forward insurer but was later revealed to be under federal investigation. These weren’t outliers. They were standard. Investor decks promised 10x revenue growth and market dominance. Cash flow was always \"just a year or two away.\"\nSPACs operate on a two-year deadline to complete a deal or return capital. That timeline created urgency, not quality. Many sponsors pushed through weak deals to meet the clock. Due diligence suffered. As a result, over 60% of SPACs from that boom now trade under $5. Some are down over 90%. Investors didn’t buy businesses. They bought marketing slides and a dream.\nWhat’s Different Now? Not Enough\nWall Street doesn’t have a long memory. And it rarely admits mistakes. As SPACs reappear in the headlines, the narrative has shifted. Sponsors say this new batch is more disciplined: better targets, tighter structures, and improved governance. The pitch has changed, but the incentives haven’t.\nSponsors still get paid if a deal closes, no matter how it performs. Their promoter usually hands them 20% of the post-merger equity for little or no cost. That means millions in upside for getting a deal across the line—even if the company craters. Meanwhile, retail investors are left with stock in businesses that may have less cash, fewer assets, and no clear plan.\nRedemptions are another warning sign. In many recent SPACs, more than 80% of the initial capital was withdrawn before the merger. That leaves the company underfunded on day one. Sponsors patch the gap with last-minute PIPEs or debt deals, moves that weaken the structure further.\nAnd retail still comes in last. By the time the average investor hears about the deal, the best terms are already taken. PIPE investors get their discounts. Sponsors take their free shares. What’s left is a press release, a public ticker, and a lot of misplaced optimism.\nAs one hedge fund analyst put it to me, \"Sure, the paint looks fresh. But the engine’s still busted.\"\nThe Illusion Of Cheap\nSome SPACs now trade well below trust value. On paper, they look like bargains. But cheap prices often signal something deeper: real risk.\nThe incentives haven’t changed. Sponsors still hold upside through warrants and promote shares that dilute common shareholders. Most deals still include preferred equity, convertibles, or earn-out structures that cut into future gains if the stock doesn’t run. Then comes dilution. These post-merger companies often need new capital quickly. That means issuing stock at lower prices, repricing warrants, or cutting side deals with PIPE investors. Shareholders get diluted. Ownership shrinks, even if the stock doesn’t move.\nLiquidity is another problem. Many of these stocks have thin floats and wild price action. It only takes a small group of traders to move the price 10% or more in a day. That illusion of volume can vanish fast. Meanwhile, insiders and early backers often have structured ways to exit while retail is still buying.\nJust because a SPAC trades at $3 doesn’t make it a bargain. If it’s got no cash, weak fundamentals, and layers of dilution, it’s not discounted. It’s dangerous.\nWhat to Watch If You Must Play\nNot every SPAC is a dud. A few have created value. But the good ones don’t come with billboards and buzz. If you’re still going to fish in these waters, use better bait. Start with the sponsor. Do they have a track record of building real businesses? Or are they serial promoters chasing fees? Look for personal capital at risk and evidence they’re not just passing through. Next, check the cash. How much money will the company have after redemptions? A deal that closes with an empty trust account is already in trouble.\nInsider behavior is key. Are they buying shares in the open market? Participating in the PIPE? Or lining up the exits? Follow the money, not the marketing. And finally, evaluate the business. Is there revenue? Margins? A clear path to profitability? If it relies on projections five years out with no current traction, it probably won’t deliver.\nReal Opportunities Live Elsewhere\nYou don’t need to chase SPACs to find upside. There are cleaner plays with better setups and stronger alignment.\nSpin-offs, for example, are consistently fertile ground. When companies split off divisions, it often unlocks value, especially when insiders keep equity and focus on performance. These are companies with an operating history, not just a pitch deck.\nBroken IPOs are another space worth watching. These are stocks that went public at overhyped prices and got crushed. But when the smoke clears, the underlying business may still be strong, cash flowing, growing, and forgotten by the crowd. Turnarounds offer potential too. They’re messy and often unloved. But when you find a name with a clean balance sheet, management alignment, and early signs of operational recovery, the upside can be real. It takes work. But it’s real investing.\nSPACs didn’t fade because they worked. They faded because they failed. Their return isn’t a sign of progress. It’s a sign that markets forgot what happened the last time.\nYou don’t need to short SPACs. But you don’t need to step back into the fire either. Investors chasing yesterday’s fantasy are likely to relive yesterday’s outcome. You want asymmetric payoff? Look where others aren’t.\nOn the date of publication, Jim Osman did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on\nBarchart.com",
  "read_time": 7
}