{
  "title": "UBS Trims P&G (PG) Price Target, Maintains Buy Rating",
  "link": "https://finance.yahoo.com/news/ubs-trims-p-g-pg-035954635.html",
  "published": "2025-07-21T03:59:54Z",
  "body": "In This Article:\nPG\nThe Procter & Gamble Company (NYSE:\nPG\n) is one of the\nmost profitable consumer stocks to buy now\n. UBS analyst Peter Grom lowered his price target on The Procter & Gamble Company (NYSE:PG) to $180 from $186 while maintaining a\nBuy\nrating, citing refined estimates ahead of the company’s fiscal fourth-quarter results. Despite the downward adjustment, the revised target still implies an upside of about 16% from the current price of $155.\nUBS Trims P&G (PG) Price Target, Maintains Buy Rating\nCopyright:\njetcityimage / 123RF Stock Photo\nThe move reflects a more tempered near-term view rather than a shift in long-term confidence. UBS continues to see strength in P&G’s brand portfolio, which spans core categories like fabric care, grooming, and personal health. Grom noted that while foreign exchange pressures and consumer trade-down behavior are worth watching, the company’s pricing power and cost discipline remain key pillars of its strategy.\nP&G has held up well in a mixed consumer environment, benefiting from its exposure to everyday essentials and global scale. The company’s ability to maintain share across several categories, even amid softer volumes, has kept investor sentiment generally positive.\nAs earnings season approaches, analysts will be looking for commentary on volume recovery and input costs, particularly as inflation eases in certain regions. The new target reflects modest caution without undermining the firm’s broader bullish stance on P&G’s market positioning.\nWhile we acknowledge the potential of PG as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the\nbest short-term AI stock\n.\nREAD NEXT:\nTop 10 Healthcare AI Stocks to Buy According to Hedge Funds\nand\n10 Best Industrial Automation Stocks to Buy for the Next Decade\nDisclosure: None.",
  "read_time": 2
}