{
  "title": "UBS Trims Colgate (CL) Price Target, Maintains Buy Rating",
  "link": "https://finance.yahoo.com/news/ubs-trims-colgate-cl-price-040126035.html",
  "published": "2025-07-21T04:01:26Z",
  "body": "In This Article:\nCL\nColgate-Palmolive Company (NYSE:CL) is one of the\nmost profitable consumer stocks to buy now\n. UBS lowered its price target on Colgate-Palmolive (NYSE: CL) to $106 from $109 while maintaining a\nBuy\nrating, citing valuation discipline following the stock’s steady run in recent months. At the current price of $86.80, the revised target still implies an upside potential of roughly 22%.\nUBS Trims Colgate (CL) Price Target, Maintains Buy Rating\nAn array of toothpaste, toothbrushes, and mouthwashes on a bright background, highlighting the company's oral care products.\nThe firm continues to see strength in Colgate’s underlying fundamentals, particularly its strong pricing execution across global markets and steady demand for essential personal care and household products. UBS analysts noted that while foreign exchange and cost headwinds remain part of the equation, margin recovery efforts and disciplined brand investments are likely to support earnings growth through the back half of the year.\nColgate has seen consistent performance across its oral care and pet nutrition segments, with emerging markets showing signs of improving volumes. The updated target reflects a more balanced outlook as shares approach levels UBS considers closer to fair value, rather than a change in conviction about the company’s prospects.\nInvestors will be watching Colgate’s next earnings update for clarity on input cost trends and competitive dynamics, particularly as pricing begins to normalize and volume growth comes back into focus.\nWhile we acknowledge the potential of CL as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the\nbest short-term AI stock\n.\nREAD NEXT:\nTop 10 Healthcare AI Stocks to Buy According to Hedge Funds\nand\n10 Best Industrial Automation Stocks to Buy for the Next Decade\nDisclosure: None.",
  "read_time": 2
}