{
  "title": "US stocks close higher, Treasury yields soften as tariff deadlines, earnings loom",
  "link": "https://finance.yahoo.com/news/asia-shares-yen-weather-japan-004419785.html",
  "published": "2025-07-21T00:44:19Z",
  "body": "In This Article:\nUSD=X\nGOOGL\nTSLA\nIBM\nINTC\nBy Stephen Culp\nNEW YORK (Reuters) -Wall Street stocks advanced on Monday, while Treasury yields softened at the top of a busy week of corporate earnings reports, as tariff negotiations between the U.S. and its trading partners ramped up in the face of a fast-approaching August 1 deadline.\nAll three major U.S. stock indexes moved higher in opposition to their European counterparts, gold notched a five-week high and the dollar weakened against the yen in the wake of Japan's weekend elections. [.N]\nCommunication services and tech-adjacent momentum stocks were providing much of the upside muscle.\nSecond-quarter earnings season shifts into high gear this week, and the roster includes Alphabet and Tesla, two of the \"Magnificent Seven\" AI-associated megacap stocks. IBM and Intel are two high-profile tech names expected to report during a busy week that also includes a host of industrials, from General Motors to Union Pacific.\n\"We've had optimism around trade, and it's early days but we’ve had pretty good earnings so far,\" said Zachary Hill, head of portfolio management at Horizon Investments in Charlotte, North Carolina. \"So it feels a little bit like a summertime, don't-fight-the-trend environment at the moment.\"\nTrade negotiations have yet to yield any meaningful deals as the clock ticks down on U.S. President Donald Trump's August 1 tariff deadline.\n\"The market's view of who the tariffs hurt more or less has certainly waxed and waned over the last couple of months,\" Hill added. \"It's been a pretty turbulent kind of news flow, I think a lot of U.S. investors have tuned it out.\"\n\"That doesn't appear to be the case when you look overseas at other markets.\"\nU.S. Treasury Secretary Scott Bessent told CNBC, \"I think that what we need to do is examine the entire Federal Reserve institution and whether they have been successful,\" further stoking concerns over the central bank's autonomy following reports Trump is considering firing Chairman Jerome Powell.\n\"This is highly politically motivated and both Secretary Bessent, as well as President Trump, have a recognition and understanding of the enormous chaos that a non-independent Fed, or attempts to fire Chairman Powell would have on markets, and I don't believe that is their objective or desire,\" said Oliver Pursche, senior vice president at Wealthspire Advisors, in New York.\nThe Dow Jones Industrial Average fell 18.66 points, or 0.04%, to 44,323.53, the S&P 500 rose 8.89 points, or 0.14%, to 6,305.68 and the Nasdaq Composite rose 78.52 points, or 0.38%, to 20,974.18.\nStory Continues\nEuropean stocks ended a choppy session lower as investors weighed a mixed set of corporate earnings and looked for signs of progress in ongoing trade negotiations.\nMSCI's gauge of stocks across the globe rose 1.68 points, or 0.18%, to 929.67.\nThe pan-European STOXX 600 index fell 0.08%, while Europe's broad FTSEurofirst 300 index fell 2.82 points, or 0.13%.\nEmerging market stocks rose 5.45 points, or 0.44%, to 1,254.83. MSCI's broadest index of Asia-Pacific shares outside Japan closed higher by 0.2%, to 659.24, while Japan's Nikkei fell 82.08 points, or 0.21%, to 39,819.11.\nThe dollar lost ground as the yen strengthened in the aftermath of Japan's weekend election, which saw its ruling coalition lose its majority in the upper house.\nThe dollar index, which measures the greenback against a basket of currencies including the yen and the euro, fell 0.53% to 97.88, with the euro up 0.55% at $1.1689.\nAgainst the Japanese yen, the dollar weakened 0.97% to 147.37.\nBitcoin reversed previous gains won after Trump signed the GENIUS Act into law late Friday, considered a huge win for the crypto industry.\nIn cryptocurrencies, bitcoin fell 1.11% to $116,822.34. Ethereum declined 0.19% to $3,734.50.\nU.S. Treasuries rallied, pushing yields lower, as investors likely unwound short positions and followed a broader rally in European sovereign bonds driven by tariff uncertainties.\nThe yield on benchmark U.S. 10-year notes fell 4.7 basis points to 4.384%, from 4.431% late on Friday.\nThe 30-year bond yield fell 5 basis points to 4.9491% from 4.999% late on Friday.\nThe 2-year note yield, which typically moves in step with interest rate expectations for the Federal Reserve, fell 1.4 basis points to 3.863%, from 3.875% late on Friday.\nOil prices inched lower as investors shrugged off the latest European sanctions on Russian oil stocks, which are expected to have minimal supply impact. Concerns over dampening demand continued to simmer amid protracted trade negotiations.\nU.S. crude dipped 0.2% to end at $67.20 per barrel, while Brent settled at $69.21 per barrel, down 0.1% on the day.\nGold prices hit a five-week high on the softening greenback and easing Treasury yields.\nSpot gold rose 1.47% to $3,398.43 an ounce. U.S. gold futures rose 1.47% to $3,402.30 an ounce.\n(Reporting by Stephen Culp; Additional reporting by Wayne Cole in Sydney and Lucy Raitano in London; Editing by Mark Porter and Marguerita Choy)",
  "read_time": 5
}