{
  "title": "Applied Digital (APLD) Soars 9.3% as Earnings Near",
  "link": "https://finance.yahoo.com/news/applied-digital-apld-soars-9-182906621.html",
  "published": "2025-07-19T18:29:06Z",
  "body": "In This Article:\nAPLD\nCRWV\nWe recently published\nThese 10 Stocks Surprisingly Lead Gains While Wall Street Naps\n. Applied Digital Corporation (NASDAQ:APLD) is one of this week’s top performers.\nApplied Digital rallied for a fifth consecutive day, jumping 9.35 percent to close at $11.93 apiece as investors continued to snap up shares ahead of the release of its earnings performance for the fourth quarter of fiscal year 2025.\nAccording to the company, it will announce the results of its financial and operating highlights in an investor briefing on July 30 at 5 PM Eastern Time. A press release detailing its financials will follow on the same day.\nAt present, Applied Digital Corporation (NASDAQ:APLD) carries an overall optimistic rating from analysts amid its strong historical earnings.\nApplied Digital (APLD) Soars 9.3% as Earnings Near\nBayurov Alexander/Shutterstock.com\nInvestor confidence was further supported by two newly clinched 15-year leases with CoreWeave, Inc. (NASDAQ:CRWV) where Applied Digital Corporation (NASDAQ:APLD) committed to deliver 250 megawatts of critical IT load to host the former’s artificial intelligence and high-performance computing infrastructure at its Ellendale, North Dakota data center campus.\nWhile we acknowledge the potential of APLD as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on the\nbest short-term AI stock\n.\nREAD NEXT:\n30 Stocks That Should Double in 3 Years\nand\n11 Hidden AI Stocks to Buy Right Now\n.\nDisclosure: None. This article is originally published at\nInsider Monkey\n.",
  "read_time": 1
}