{
  "title": "Could This Under-the-Radar Artificial Intelligence (AI) Defense Company Be the Next Palantir?",
  "link": "https://finance.yahoo.com/news/could-under-radar-artificial-intelligence-163000570.html",
  "published": "2025-07-19T16:30:00Z",
  "body": "In This Article:\nPLTR\nBBAI\n^SPX\nKey Points\nPalantir's Foundry and Gotham platforms specialize in AI operating systems, and the U.S. military is one of the company's biggest customers.\nRecent budgetary changes at the Department of Defense suggests that investment in AI infrastructure and software services is on the rise.\nBigBear.ai is a smaller AI defense company that some investors are hoping could witness Palantir-style share price increases.\n10 stocks we like better than BigBear.ai ›\nPalantir Technologies\nwas the top-performing stock in the\nS&P 500\nand\nNasdaq-100\nduring the first half of 2025. With shares soaring by 80% through the first six months of the year -- and by 427% over the last 12 months -- Palantir has helped drive a lot of attention to the intersection of artificial intelligence (AI) and defense contracting.\nPalantir is far from the only company seeking to disrupt defense tech. A little-known competitor to the company is\nBigBear.ai\n(NYSE: BBAI)\n, whose shares are up by an impressive 357% over the last year.\nCould BigBear.ai emerge as the next Palantir? Read on to find out.\nBigBear.ai is an exciting company in the world of defense tech, but...\nBigBear.ai's share price volatility so far this year mimics the movements of a rollercoaster. Initially, shares rose considerably shortly following President Donald Trump's inauguration and the subsequent announcement of\nProject Stargate\n-- an infrastructure initiative that aims to invest $500 billion into AI projects through 2029.\nBBAI\ndata by\nYCharts\nHowever, these early gains retreated following the\nPentagon's plans to reduce its budget by 8% annually\n.\nWhile reduced spending from the Department of Defense (DOD) was initially seen as a major blow to contractors such as Palantir and BigBear.ai, the trends illustrated above suggest that shares rebounded sharply -- implying that the sell-offs back in February may have been overblown. Why is that?\nIn my eyes, a major contributor to the recovery in defense stocks came after Defense Secretary Pete Hegseth announced his intentions to double down on a strategy dubbed the Software Acquisition Pathway (SWP).\nIn reality, the DOD's budget cuts are focused on areas that are deemed non-essential or inefficient. For example, the Pentagon freed up billions in capital by reducing spend with consulting firms such as\nBooz Allen Hamilton\n,\nAccenture\n, and Deloitte. In addition, a contract revolving around an HR software system managed by\nOracle\nwas also cut.\nUnder the SWP, it appears that the DOD is actually looking to free up capital in order to double down on more tech-focused initiatives and identify vendors that can actually handle the Pentagon's sophisticated workflows.\nStory Continues\nWith so much opportunity up for grabs, it's likely that optimistic investors saw this as a tailwind for BigBear.ai. This logic isn't too far off base, either.\nBigBear.ai's CEO is Kevin McAleenan, a former government official with close ties to the Trump administration. McAleenan's strategic relationships within the government combined with the DOD's focus on working with leading software services providers likely has some investors buying into the idea that BigBear.ai won't be flying under the radar much longer.\nImage source: Getty Images.\n...how does the company really stack up beside Palantir?\nThe graph below breaks down revenue, gross margin, and net income for BigBear.ai over the last year. With just $160 million in sales, the company tends to generate inconsistent gross margins -- which top out at less than 30%. Moreover, with a fairly small sales base and unimpressive margin profile, it's not surprising to see BigBear.ai's losses continue to mount.\nBBAI Revenue (TTM)\ndata by\nYCharts\nBy comparison, Palantir generated $487 million in government revenue during the first quarter of 2025. In other words, Palantir's government operation generates nearly triple the amount of revenue in a single quarter that BigBear.ai does in an entire year. On top of that, Palantir's gross margins hover around 80%, while the company's net income over the last 12 months was over $570 million.\nIs BigBear.ai stock a buy right now?\nRight now, BigBear.ai trades at a price-to-sales (P/S) ratio of around 11. While this may look \"cheap\" compared to Palantir's P/S multiple of 120, there is a reason for the valuation disparity between the two AI defense contractors.\nPalantir boasts large, fast-growing public and private sector businesses that command strong profit margins. By contrast, BigBear.ai is going to have a difficult time scaling so long as it keeps burning through heaps of cash.\nNot only would I pass on BigBear.ai stock, but I also do not see the company becoming the next Palantir. Palantir is in a league of its own in the defense tech space, and I do not see BigBear.ai as a formidable challenger.\nShould you buy stock in BigBear.ai right now?\nBefore you buy stock in BigBear.ai, consider this:\nThe\nMotley Fool Stock Advisor\nanalyst team just identified what they believe are the\n10 best stocks\nfor investors to buy now… and BigBear.ai wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when\nNetflix\nmade this list on December 17, 2004... if you invested $1,000 at the time of our recommendation,\nyou’d have $652,133\n!* Or when\nNvidia\nmade this list on April 15, 2005... if you invested $1,000 at the time of our recommendation,\nyou’d have $1,056,790\n!*\nNow, it’s worth noting\nStock Advisor’s\ntotal average return is 1,048\n% — a market-crushing outperformance compared to 180% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join\nStock Advisor\n.\nSee the 10 stocks »\n*Stock Advisor returns as of July 15, 2025\nAdam Spatacco\nhas positions in Palantir Technologies. The Motley Fool has positions in and recommends Abbott Laboratories, Accenture Plc, Oracle, and Palantir Technologies. The Motley Fool has a\ndisclosure policy\n.\nCould This Under-the-Radar Artificial Intelligence (AI) Defense Company Be the Next Palantir?\nwas originally published by The Motley Fool",
  "read_time": 5
}