{
  "title": "Invesco (IVZ) Climbs on 3rd Day on Expected Multi-Million Dollar Profit from ETF",
  "link": "https://finance.yahoo.com/news/invesco-ivz-climbs-3rd-day-182216656.html",
  "published": "2025-07-19T18:22:16Z",
  "body": "In This Article:\nIVZ\nQQQ\n^NDX\nWe recently published\nThese 10 Stocks Surprisingly Lead Gains While Wall Street Naps\n. Invesco Ltd. (NYSE:IVZ) is one of this week’s top performers.\nInvesco extended its winning streak to a third consecutive day on Friday, jumping 15.28 percent to close at $19.92 apiece amid plans to convert one of its profitable offerings—the QQQ ETF, which tracks the Nasdaq 100—to an open-traded fund.\nInvesco Ltd. (NYSE:IVZ) filed its preliminary proxy statement with the Securities and Exchange Commission (SEC) seeking the consent of QQQ shareholders to operate the ETF and convert it from a “unit investment trust” to that of a “management company.”\nUnder current circumstances, QQQ’s $355-billion in assets and 0.2-percent expense ratio currently generates $711 million in annual fee revenues, more than any other ETF, but leaves nothing to Invesco Ltd. (NYSE:IVZ) as the current setup gives the bulk divided between the fund’s trustee, Bank of New York Mellon, and Nasdaq, which provides the index. As mandated by the fund’s prospectus, any remaining revenues must be spent on marketing QQQ.\nInvesco (IVZ) Climbs on 3rd Day on Expected Multi-Million Dollar Profit from ETF\nA close-up of a financial executive looking intently at their laptop screen, with a wall of financial charts in the background.\nAccording to Bloomberg, the dynamics will change upon approval of the shareholders of its intent, and will also see lower expense ratios of 0.18 percent.\nWhile we acknowledge the potential of IVZ as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on the\nbest short-term AI stock\n.\nREAD NEXT:\n30 Stocks That Should Double in 3 Years\nand\n11 Hidden AI Stocks to Buy Right Now\n.\nDisclosure: None. This article is originally published at\nInsider Monkey\n.",
  "read_time": 2
}