{
  "title": "QuantumScape (QS) Skyrockets 52% W/W as Production Milestone Bolsters Outlook",
  "link": "https://finance.yahoo.com/news/quantumscape-qs-skyrockets-52-w-173459108.html",
  "published": "2025-07-19T17:34:59Z",
  "body": "In This Article:\nQS\nWe recently published\n10 Stocks With Unbelievable Gains This Week\n. QuantumScape Corporation (NYSE:QS) is one of this week’s biggest players.\nQuantumScape surged by 51.68 percent in just a week’s trading, extending its rally to a ninth consecutive day on Friday to close at $14.64, as investors appeared overly optimistic about its new production milestone, taking the chance to position ahead of its second quarter earnings performance.\nContinued investor confidence appeared to be driven by the company’s announcement last month that it had achieved a new milestone that would scale up its production capabilities.\nCalled the Cobra separator, the new process is designed to enable faster, more energy-efficient production with a smaller equipment footprint compared to earlier processes.\nAs compared with the prior generation Raptor process, QuantumScape Corporation (NYSE:QS) said Cobra offers a ~25x improvement in heat treatment speed and occupies a fraction of the physical space per film start—both of which are key advantages in the design of a scalable gigafactory production line.\nQuantumScape (QS) Skyrockets 52% W/W as Production Milestone Bolsters Outlook\nA line of electric vehicles parked in front of a research & development building in San Jose, California.\nInvestors will be closely watching out for QuantumScape Corporation’s (NYSE:QS) updated outlook for the rest of the year, with a new production process now in full swing. The company is set to release its second quarter earnings results and hold an investor call on Wednesday, July 23, after the market close.\nWhile we acknowledge the potential of QS as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on the\nbest short-term AI stock\n.\nREAD NEXT:\n30 Stocks That Should Double in 3 Years\nand\n11 Hidden AI Stocks to Buy Right Now\n.\nDisclosure: None. This article is originally published at\nInsider Monkey\n.",
  "read_time": 2
}