{
  "title": "Supermarket bosses attack Reeves’s plan for fresh tax raid",
  "link": "https://finance.yahoo.com/news/supermarket-bosses-attack-reeves-plan-160000345.html",
  "published": "2025-07-19T16:00:00Z",
  "body": "In This Article:\nTSCO.L\nSBRY.L\nRachel Reeves is considering a shake-up of business rates for department stores, supermarkets and those with larger premises - Justin Tallis/AFP via Getty Images\nTesco and Sainsbury’s have warned Rachel Reeves that plans for a\n£1.7bn tax raid on big shops\nwould accelerate the decline of the high street.\nThe intervention by the country’s two largest supermarkets marks a significant escalation in the backlash against the Chancellor’s plans for a shake-up of the business rates system.\nRetail chiefs fear will Ms Reeves will deal another devastating blow to Britain’s struggling town centres.\nKen Murphy, boss of Tesco, told The Telegraph that the move threatened “investments in customers, colleagues and communities”.\nHis comments are likely to\nfuel fears of fresh price rises\n, redundancies and another cull of shops as retailers look to offset swinging cost rises introduced by a cash-strapped Labour Government at the last Budget.\nThe reforms will increase business rates for department stores, supermarkets and those with larger premises.\nMr Murphy said: “Increasing the burden on large shops would hinder rather than help our town centres. Many of these shops are anchor stores in their local communities.”\nSimon Roberts, the Sainsbury’s boss, predicted that retail’s big beasts would “pull away from our high streets” as they sought to weather a jump in National Insurance contributions and minimum wage increases.\nThe sector is also concerned about the\npotential costs of of Angela Rayner’s Employment Rights Bill\n.\nMr Roberts said: “The changes being proposed will further increase the negative impact of business rates and won’t stimulate the growth or investment into our high streets and jobs that we all want to see. The Government promised fundamental reform to level the playing field but the changes we are hearing about will not deliver this – they will not stimulate growth or investment.”\nOpposition is also mounting beyond the big grocers. Alex Baldock, the boss of electricals giant Currys, accused Ms Reeves of “rushing” changes to the business rates system that will have widespread implications for retailers already grappling with a tsunami of additional government-imposed costs.\nJobs at risk\nOver-burdened retailers are already grappling with “a perfect storm” of “extra costs and red tape”, which is “bad for jobs, investment and growth,” he said. “The mooted hikes in business rates will just make things worse.”\nMr Baldock warned that the overhaul would “shutter more stores” and “leave more gaps on the high street”, as well as\nharming employment opportunities for young people\n.\nThierry Garnier, the chief executive of B&Q’s parent company Kingfisher, warned that the Treasury’s latest tax grab would harm “communities across the UK”.\nStory Continues\nNo work nation - UK monthly change in payroll employment (000s)\nThe Chancellor is expected to use her next Budget to ramp up business rates in a desperate attempt to plug a £5bn hole in the public finances created by abrupt about-turns on benefits and winter fuel cuts.\nAs part of efforts to level the playing field, businesses with bigger premises will be charged more in order to reduce the rates paid by smaller stores. The effective discount is intended to target online retailers and save independent firms, ministers contend.\nLast month, the British Chambers of Commerce warned that tax rises are “paralysing” British businesses. One in three companies were cutting jobs to weather the £25bn National Insurance raid, it said.\n“Larger physical stores, which support more jobs, should not be penalised through a higher multiplier,” Mr Garnier said.\nPub bosses protest\nThe hospitality industry is also braced for further pain with pub bosses queueing up to express their disquiet last week. Simon Emeny, the chief executive of Fuller’s, said pubs were already labouring under “a ridiculously disproportionate” £25bn business rates burden.\nSir Tim Martin, the boss of JD Wetherspoon,\ncomplained that pubs were already having to contend with a “ferocious tax disadvantage\n”. The sector maintains it is unfair that pubs pay VAT on food sales while supermarkets do not have to, enabling them to sell alcohol at a discount to pubs.\nMeanwhile, the Government’s own analysis shows that the impact of the planned reforms will be felt far and wide from hotels, restaurants and theatres to cinemas, theme parks and even zoos. At the same time, only a fifth of those are warehouses used by internet retailers.\nIn a speech to prominent City figures attending the Mansion House dinner in London on Tuesday evening, Ms Reeves claimed “Britain is better off under Labour”.\nThe Treasury was contacted for comment.\nBroaden your horizons with award-winning British journalism. Try The Telegraph free for 1 month with unlimited access to our award-winning website, exclusive app, money-saving offers and more.",
  "read_time": 4
}