{
  "title": "'I'm not here to pump up a stock': The hedge funder who sparked a speculative frenzy says he's not playing the meme stock game",
  "link": "https://finance.yahoo.com/news/im-not-pump-stock-hedge-173001108.html",
  "published": "2025-07-28T17:30:01Z",
  "body": "A screen displays stock charts while a trader works at his post\nThomson Reuters\nOpendoor\nisn't a meme stock, says the hedge funder whose thesis sparked a huge rally in the shares.\nEric Jackson, known for his call on\nCarvana\nin 2023, thinks Opendoor can rally more than 3,000%.\nHe says Opendoor shouldn't be lumped together with other meme stocks that surged this week.\nThe architect of the latest meme stock rally doesn't want you to call him that.\nEric Jackson, the founder of EMJ Capital, is bullish on\nOpendoor\n—the online real estate platform that embarked on\na blistering rally\nafter he posted his\nthesis on X\n—but it isn't a meme stock, he says.\nIn his eyes, it's the real deal, a pandemic-era darling with big turnaround potential despite a 92% tumble since its peak.\nJackson is known for what ended up being a correctly bullish call on Carvana in 2023. He laid out his views on Opendoor on social media on July 14, sparking not only a rapid rise in the stock, which also seems to have revived the meme stock trade among a newer group of unloved stocks, including\nKohl's\n,\nKrispy Kreme\n, and\nGoPro\n.\nBut for Jackson, Opendoor isn't a joke. He declined to disclose the value of his firm's stake, but it's now the single biggest position in EMJ Capital's portfolio, he told Business Insider.\n\"I never thought of it that way,\" he said of investors who called Opendoor a\nmeme stock\n. \"So I sort of take offense, because I find all the meme stocks to be, to me, kind of terrible businesses that I would never want to own. Whereas I see Opendoor as a legitimate turnaround story.\"\nOpendoor will probably be the only company among the meme-stock cohort that won't be forgotten about by next week, he said, adding that he sees the latest speculative buying spree fizzling out. Indeed, most of this week's meme stock cohort was already giving up their biggest gains by midday on Friday.\nOpendoor's stock price spiked as high as $4.97 this week in intraday trading, an almost 830% increase in July.\nThe stock has since pared its gains, trading around $2.46 a share on Friday, but Jackson still thinks shares could hit $82 within the next several years, a gain that would mark a 3,200% increase from current levels.\nThe next leg-up for the stock could come in the next few weeks when the company reports third-quarter earnings, Jackson said.\n'I'm not here to pump up a stock'\nOpendoor first appeared on Jackson's radar in 2022, around the time he started paying attention to Carvana. In a podcast called \"The Compound and Friends,\" he said he believed both companies, which were struggling at the time, could stage a massive turnaround.\nStory Continues\nHis bet on Carvana paid off. Shares of the online used car retailer have risen almost 7,000% since the beginning of 2023.\nThe bet on Opendoor — until now — did not. The stock traded between $1-$3 a share around the time Jackson finally gave up on the call and cashed out his shares nine months ago.\n\"It's like having a painful ex in your history and you just don't want to look at their Instagram page or something like that, because it just brings up bad feelings,\" he said.\nJackson thinks the story could be different this time around for a few reasons:\nOpendoor stock now looks similar to Carvana when Jackson first made his call on the used car seller. Opendoor shares were trading under $1 around the time he fired off a series of posts about the company on X.\nOpendoor has aggressively slashed its costs in recent years. In 2024, it cut its workforce by 17%.\nThe firm doesn't have much competition in the iBuying space now that\nZillow and Redfin have exited that business\n.\nOpendoor was likely \"thrown for a loop\" by the Fed keeping interest rates higher for longer than expected in 2022 and 2023, Jackson said. High borrowing costs significantly impact the real estate sector, but most investors expect the central bank to cut rates several more times this year, potentially stimulating fresh activity in the housing market.\nOpendoor might also be able to benefit from a big AI play, Jackson told BI, citing conversations with a former company insider.\nJackson says what he sees going for Opendoor sets it apart from the meme stocks at the center of this week's euphoric rally.\n\"Does Kohl's have an AI strategy? Does American Eagle, other than hiring\nSydney Sweeney\n, have an AI strategy? I mean, GoPro — I mean, come on,\" he said of the other meme stocks in the spotlight.\nOn social media, Jackson frequently tells his followers he's on the quest to find the next \"\n100-bagger\n,\" a term coined by the investor\nChris Mayer\nto describe an investment that has the potential to return 100 times its value over the long run.\nJackson's firm, which has also started leaning on AI models to identify stocks with glimmers of potential, tries to look for three things, he said:\nHave other people given up on the stock?\nDoes it look substantially mispriced?\nDoes it look like it has a sustainable turnaround trajectory?\nIf the answers are \"yes,\" it could be a winning trade, though he acknowledges the approach isn't an exact science.\nSuccessful investments Jackson has made that he deems as 100-baggers include\nAlibaba\n,\nMicrosoft\n,\nCoinbase\n, and\nRoku\n, he said in a\npost\non X in June.\nThe Opendoor call, in particular, has garnered him a lot of attention. Speaking to\nBloomberg\n, Jackson said his firm had received 600 calls or emails from people inquiring about his fund and investment ideas in the last several weeks. Since posting the Opendoor thread on X, he told BI he's spoken with investors all over Asia, Africa, Europe, and South America who buy into his call, but he has also come across \"a lot of negative stuff\" on X about his thesis.\n\"I guess it comes with the territory when you stick your neck out there as a real person with real thoughts. You get all these anonymous trolls chirping back at you,\" he said.\n\"I really hope that if all of retail and all institutional investors truly believe in this $82 story, my hope is they zero in with like, the Death Star on this planet, and just buy and hold,\" he said, adding that he believed investors could stage a rally similar to\nCisco's\nmeteoric rise during the dot-com bubble.\nImportantly, he emphasized that he's not a fan of people saying he sparked the meme stock rally.\n\"But I'm some grifter or flipper, no. I'm in this for the long run. I'm not here to pump up a stock and jump out of it. I've never done that.\"\nRead the original article on\nBusiness Insider",
  "read_time": 6
}