{
  "title": "Behind Michael Gelband and $11 billion hedge fund ExodusPoint's strong year",
  "link": "https://finance.yahoo.com/news/behind-michael-gelband-11-billion-172502721.html",
  "published": "2025-07-28T17:25:02Z",
  "body": "Wall Street bull\nRobert Nickelsberg/Getty Images\nMichael Gelband's ExodusPoint is atop the leaderboard midway through 2025, besting peers like Millennium.\nThe $11 billion firm was the biggest launch in industry history, starting with more than $8 billion in 2018.\nThe manager has leaned on its fixed-income expertise to drive strong returns this year.\nThere were sky-high expectations for the ExodusPoint Capital Management when it launched 7 years ago. It's starting to meet them.\nThe $11 billion firm was the largest launch in industry history in 2018 thanks to the stellar track record of cofounder Michael Gelband, who previously led Millennium's fixed-income division. He told former colleagues that his unit generated $7 billion in trading revenue in his eight years at Izzy Englander's firm, and hedge fund backers rushed to invest in his new firm, which started trading with a record $8.5 billion.\nBut putting all of the capital to work, hiring scores of investors, setting up the necessary infrastructure, and finding the right leadership took time. The firm, which was also cofounded by former Millennium equities executive Hyung Lee,\nwas a relative disappointment\nat the start, with the difficult reality of being compared to funds like the cofounders' former employer and Ken Griffin's Citadel from day one.\nNow, a little over seven years after the manager first began trading, the New York-based firm\nhas outperformed its peers\nin 2025 and over the last 12 months. The manager is up more than 9% after a 1.8% June gain. Since the start of July 2024, ExodusPoint has returned more than 18%.\nA person with direct knowledge of the firm's operations pointed to several factors as to why. This person is not permitted to speak publicly about the manager's operations.\nIn a roller coaster equities market, ExodusPoint has benefited from its fixed-income lean. Roughly 75% of the firm's risk is in fixed-income books, the person close to the firm said, which is Gelband's specialty, though the cofounder does not manage money himself. Jon Hoffman, a former Lehman Brothers trader who worked with Gelband at the bank, is one of the firm's best-known portfolio managers with his basis-trade strategy.\nGelband is now the sole chief investment officer after Lee stepped down in 2024 (the cofounder, who had relocated to Puerto Rico, is currently a senior advisor). The firm made several hires in 2023 who have led units that were previously under Lee's purview, such as Adam Galeon and Michael Lapsa, who run long-short equities and systematic strategies, respectively. Peter McConnon, once the head of London macro for Balyasny, was also brought in during this time as a senior managing director of fixed income and macro.\nStory Continues\nWhile members of the original team such as Lee and former chief risk officer Dev Joneja have moved into advisory roles, Garrett Berg, a day-one employee who has since been promoted to president and COO, and Kunal Kumar, a former Balyasny executive who joined in 2023 and is now chief risk officer, have been a big part of the progress on both the investment and non-investment sides of the business, this person said.\nThe firm also adopted\na cash hurdle\nfor performance fees last year, meaning ExodusPoint only collects performance fees when it returns more than a Treasury bill. This has lowered the overall fee rate of the firm, boosting net returns.\nLastly, the firm has been strategic about how it expands and hires. While headcounts at multistrategy funds have exploded in recent years, ExodusPoint reduced its staff slightly since 2022, according to regulatory filings compiled by industry data tracker Old Well Labs.\nThe firm's overall headcount stood at 688 in 2022 and is now roughly 650, the data show.\nAfter raising $1 billion in new cash in 2023, the firm is closed to new capital, like many of its peers, and is not looking to expand into different strategies or markets like commodities or private credit, the person said.\nRead the original article on\nBusiness Insider",
  "read_time": 3
}