{
  "title": "Can Apple's Slim iPhone And Cheaper Macs Reverse The 2025 Stock Slump?",
  "link": "https://finance.yahoo.com/news/apples-slim-iphone-cheaper-macs-174858441.html",
  "published": "2025-07-28T17:48:58Z",
  "body": "In This Article:\nAAPL\nGOOGL\nApple\n(NASDAQ:\nAAPL\n) is gearing up for a significant rebound in the second half of fiscal 2025, driven by the highly anticipated launch of new product cycles, including a ‘slim’ iPhone, and sustained momentum in its lucrative Services division, even as it contends with rising tariff costs and ongoing regulatory challenges.\nOn Monday,\nBank of America Securities\nanalyst Wamsi Mohan\nreaffirmed a Buy rating\non Apple, maintaining a price forecast of $235.\nAs Apple prepares to release its fiscal third-quarter earnings on July 31, investor sentiment, as noted by Mohan, remains somewhat subdued.\nAlso Read:\nApple Faces Existential Threat If It Fails To Act On GenAI\nKey concerns include escalating tariff-related costs, scrutiny from the Department of Justice regarding Google’s traffic acquisition cost (TAC) payments, ongoing headwinds for the App Store, and the perceived slow pace of Apple’s advancements in artificial intelligence.\nNevertheless, the impending earnings call is expected to shift focus towards gross margin trends and the projected recovery trajectory fueled by forthcoming product launches.\nFor fiscal third-quarter 2025, Mohan projects revenue of $90.2 billion and earnings per share (EPS) of $1.45, figures that slightly surpass consensus Street estimates of $89.3 billion and $1.43, respectively.\nThe analyst anticipates a gross margin of approximately 46.1%, aligning with Apple’s guidance midpoint, despite the absorption of an estimated $900 million in tariff-related costs.\nLooking ahead to the fourth quarter, projections indicate revenue of $99.5 billion and EPS of $1.66, largely in line with Street expectations.\nWhile gross margin is projected to dip to 45% due to an additional $1 billion in tariff impact, Mohan views this quarter as a trough, with margins expected to improve heading into fiscal 2026.\nMohan noted that a key driver of this expected rebound is the highly anticipated “slim” iPhone, potentially branded as the iPhone “Air,” which Apple is likely to launch in fall 2025.\nThe analyst said that this model, expected to replace last year’s Plus version, will reportedly have a 6.6-inch display, measure just 6mm thick, and carry a price tag $100 higher than the Plus.\nHe noted that the shift in product mix toward higher average selling prices (ASP) is anticipated to drive gross margin expansion and boost replacement rates. Mohan modeled stronger iPhone sales in the September and December quarters on the back of this launch.\nOn the Mac front, Apple is expected to benefit from the March launch of the new MacBook Air featuring the M4 chip, which provides improved performance at a reduced entry price of $999, or $100 lower than its predecessor, the analyst noted.\nStory Continues\nHe said this is expected to drive better-than-seasonal Mac revenue in the June and December quarters. Similarly, Mohan said the iPad segment could receive a boost from the expected fall launch of iPad Pro models equipped with the M5 chip. The analyst anticipates revenue growth in iPads driven by higher ASPs and product upgrades.\nApple’s Services segment continues to show steady growth, Mohan noted. For the third quarter, he expects Services revenue of $27.1 billion, up 2% quarter-over-quarter and 12% year-over-year.\nSubstantial year-over-year gains are projected across the App Store (+12%), Licensing (+18%), Subscriptions (+9%), and Apple Pay (+18%), as per the analyst.\nFor the fourth quarter, Services are projected to rise another 3% sequentially to $28 billion, again marking a 12% annual increase, with Licensing and Apple Pay both expected to grow over 20% year-over-year, Mohan noted.\nMohan slightly raised estimates for the full fiscal year 2025. Revenue is now forecast at $409 billion (up from $408 billion), and EPS at $7.15 (up from $7.13). The price forecast remains $235, based on a 29x multiple of fiscal 2026 estimated EPS of $8.20.\nWhile Apple faces near-term margin pressure and regulatory noise, Mohan noted upside potential in new product cycles, improving Services momentum, and ASP-driven gross margin recovery, positioning the stock for renewed strength in the back half of the year.\nAAPL\nPrice Action:\nApple stock is trading higher by 0.10% to $214.06 at last check on Monday.\nRead Next:\nPony.ai Gets Green Light For Driverless Robotaxis In Shanghai’s Pudong\nImage via Shutterstock\nLatest Ratings for AAPL\nDate\nFirm\nAction\nFrom\nTo\nMar 2022\nBarclays\nMaintains\nEqual-Weight\nFeb 2022\nTigress Financial\nMaintains\nStrong Buy\nJan 2022\nCredit Suisse\nMaintains\nNeutral\nView More Analyst Ratings for AAPL\nView the Latest Analyst Ratings\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools.\nClick now to access unique insights\nthat can set you ahead in today's competitive market.\nGet the latest stock analysis from Benzinga?\nThis article\nCan Apple's Slim iPhone And Cheaper Macs Reverse The 2025 Stock Slump?\noriginally appeared on\nBenzinga.com\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.",
  "read_time": 4
}