{
  "title": "Ceva Logistics restructures North America operations, names new chief",
  "link": "https://finance.yahoo.com/news/ceva-logistics-restructures-north-america-172557400.html",
  "published": "2025-07-28T17:25:57Z",
  "body": "Supply chain services giant Ceva Logistics has appointed Yves Laforgue, who joined the company last year through the acquisition of France-based Bolloré Logistics, as its new North America coordinator to better align regional operations with management’s vision, according to an internal communication.\nCEO Mathieu Friedberg told employees in a memo on Friday that he is restructuring the North American organization, with Laforgue in charge, so it can capitalize on upcoming investments by parent company CMA CGM Group, and improve profit margins as it works to integrate Bolloré Logistics into its sprawling organization.\nLaforgue will continue his duties as CEO for Ceva Logistics Air & Ocean North America in addition to holding the new role.\nOcean shipping giant CMA CGM, which acquired Ceva Logistics in 2019 and bought Bolloré Logistics in February 2024 for $5.2 billion as part of its transformation into a vertically integrated logistics services provider,\nannounced in March that it would invest $20 billion over four years\nin U.S. ocean, air cargo and warehousing operations.\nCeva Logistics is now the fifth largest global logistics service provider by gross revenue.\n“In anticipation of these investments and to ensure that we are delivering on our three critical areas for success in 2025 — profitable growth, modernization and efficiency, and people — I have decided to reposition our NORTAM organizational structure and processes to enable greater efficiency, agility and cohesion,” Friedberg said in the message, which was obtained by FreightWaves.\nA Ceva employee, who spoke on condition of anonymity to avoid potential job retaliation, described operations on the ground as “dysfunctional.”\n“In his new role, Yves will focus on aligning and coordinating regional initiatives that span our products and functions. In addition, he will represent the company in front of public authorities and support our customers globally. His mandate is to simplify governance, accelerate decision making and make Ceva more agile and more responsive to the needs of our customers and our NORTAM teams on the ground,” Friedberg told staff members. “We will accelerate in North America and need to create the right momentum and governance as close to the ground as possible.\nAlison Jahn, head of marketing and communications for Ceva North America, declined to comment on the organizational changes.\nLaforgue spent 30 years as an executive at Bolloré Logistics, including most recently as CEO of the Americas.\nCeva has spent the past 18-months integrating Bolloré under its brand. Bolloré, which operated in 148 countries and employed 15,000 people, was a major air and ocean freight management company with additional capabilities in contract logistics, multimodal transportation, and e-commerce logistics.\nStory Continues\nCeva Logistics has continued to grow this decade through CMA CGM acquisitions of French automobile logistics provider GEFCO, Ingram Micro’s e-commerce and lifestyle services business, and French last-mile delivery company Colis Privé Group. CMA CGM also launched its own all-cargo airline three years ago.\nClick here for more FreightWaves/American Shipper stories by Eric Kulisch.\nWrite to Eric Kulisch at\nekulisch@freightwaves.com\n.\nRELATED STORIES:\nCMA CGM to invest $20B in US shipping, supply chain capabilities\nCeva Logistics to acquire logistics provider in Turkey\nThe post\nCeva Logistics restructures North America operations, names new chief\nappeared first on\nFreightWaves\n.",
  "read_time": 3
}