{
  "title": "EU-US trade deal could add up to $19 billion in pharma industry costs, analysts say",
  "link": "https://finance.yahoo.com/news/eu-us-trade-deal-could-174146078.html",
  "published": "2025-07-28T17:41:46Z",
  "body": "In This Article:\nSAN.PA\nROG.SW\nSDZ.SW\nTMO\nBy Bhanvi Satija\n(Reuters) -The European Union's trade deal with the United States could cost the pharmaceutical industry between $13 billion and $19 billion as branded medicines become subject to a tariff of 15%, analysts said on Monday.\nThe added costs could raise prices for consumers unless pharmaceutical companies take action to mitigate the impact of the tariffs, one of the analysts said.\nPharmaceuticals had historically been exempt from duties. Medicines are the largest European exports to the United States by value and the EU accounts for about 60% of all pharmaceutical imports to the U.S.\nOn Sunday, European officials said that a bilateral trade deal for an across-the-board 15% tariff included pharmaceuticals, except for some generic drugs, which would be subject to no tariffs.\nThe U.S. has been conducting a national security investigation into the pharmaceutical sector and the industry has been bracing for separate sectoral tariffs. President Donald Trump said earlier this month, before negotiating the bilateral deal, that pharmaceutical tariffs could be as high as 200%.\nSome Wall Street analysts said that they do not expect additional tariffs on the EU as a result of the investigation, but others cautioned that the deal was not yet signed and that several questions remained unanswered.\nUBS analyst Matthew Weston said that he expects details of the trade deal to include protective measures for EU pharma exports from the U.S. investigation, especially since such measures are being discussed in negotiations with the United Kingdom and Switzerland.\nING analyst Diederik Stadig also said that while tariffs on top of the 15% were not expected, even after the conclusion of the national security investigations, nothing is completely clear \"until a trade deal is inked.\"\nStadig estimates that these levies could add $13 billion to industry expenses without any mitigation strategies, and some of that could be ultimately borne by the consumer.\nBernstein analyst Courtney Breen puts the additional expenses at $19 billion for the industry, but she notes that companies might be able to absorb some of the costs with the measures they have been implementing — such as stockpiling of drug products and new deals with contract researchers.\nEarlier this month, Sanofi said it will sell a manufacturing facility in New Jersey to Thermo Fisher, where the French drugmaker's therapies will continue to be manufactured. Roche's CEO Thomas Schinecker said last week that the company was increasing its U.S. inventories to avoid any immediate disruption from tariffs.\nStory Continues\nUBS' Weston said that it was not immediately clear which generic drugs were exempted from duties under the deal, but any impact for generic drugmaker Sandoz for this year should mostly be manageable.\nShares in pharmaceutical companies Sanofi, Roche and Sandoz Group all closed up between 0.5% and 1% on Monday.\n(Reporting by Bhanvi Satija in Bengaluru; Editing by Alan Barona)",
  "read_time": 2
}