{
  "title": "Fiserv Stock Gets Pummeled After Earnings - Looks Cheap Here",
  "link": "https://finance.yahoo.com/news/fiserv-stock-gets-pummeled-earnings-182637699.html",
  "published": "2025-07-28T18:26:37Z",
  "body": "In This Article:\nFI\nFiserv, Inc_ offices-by JHVEPhoto via iStock\nFiserv, Inc. (\nFI\n)\nstock has declined by over 13% in the last week since its Q2 earnings were released. But was it really all that bad? After all, it generated strong earnings and free cash flow. FI stock looks cheap here. Short OTM puts for a lower buy-in.\nFI\nis at\n$142.50\n, down from\n$165.98\non July 22, just before its July 23 Q2 earnings release. This is well below its $237.79 peak on March 3.\nMore News from Barchart\nOption Volatility And Earnings Report For July 28 – Aug 1\nShould You Grab This ‘Strong Buy’ Semiconductor Stock Ahead of Earnings?\n1 Options Trade You Can Use to Protect Historic Gains in Red-Hot Palantir Stock\nGet exclusive insights with the FREE Barchart Brief newsletter. Subscribe now for quick, incisive midday market analysis you won't find anywhere else.\nFI stock - last 6 months - Barchart - July 28, 2025\nBased on its historical averages and free cash flow, FI stock could be worth at least 28% more at\n$182.00\nper share.\nMoreover, one way to set a lower buy-in is to short out-of-the-money (OTM) put options. This article will delve into that.\nGood Earnings and Free Cash Flow (FCF)\nFiserv, the payments and financial security solutions company, said its Q2 adjusted revenue was up 8% YoY, and adjusted earnings per share (EPS) rose 16%. This included an increase in its adjusted operating margin for the first half to almost 40% (39.6%).\nMoreover, its Q2 free cash flow (FCF) was up substantially to almost $1.2 billion, or 21.5% of sales. In the trailing 12 months (TTM) period, it has generated $5.157 billion in FCF according to Stock Analysis, although Fiserv says on page 3 and page 8 of its deck that it was $5.299 billion.\nFiserv TTM free cash flow - page 8 of Q2 earnings deck\nThat works out to a 24.4% FCF margin using the Stock Analysis figures and 25.1% using Fiserv's TTM number. We can use that to estimate its FCF in the next 12 months (NTM).\nProjecting FCF for Fiserv\nManagement said its estimate is $5.5 billion in FCF for 2025. Let's look at that. Right now, analysts are projecting $20.78 billion in revenue for 2025. So, using a 25% FCF margin:\n$20.78 billion x 0.25 =\n$5.195 billion\nFCF\nHowever, next year, analysts foresee revenue of $22.46 billion. Using a 25% FCF margin, FCF could hit\n$5.615\nbillion.\nThat means FCF could range between $5.2 and $5.6 billion over the next 12 months, using a 25% FCF margin. So, management's estimate of $5.5 billion for 2025 could imply its FCF margin will rise.\nHowever, if Fiserv hits $5.5 billion this year and $5.6 billion next year, it's likely the FI stock could rise.\nFCF-Based Target Price For FI Stock\nFiserv does not pay a dividend. Let's assume it paid out 100% of its free cash flow. What would the dividend yield be?\nStory Continues\nOne way to estimate this is to use its historical FCF yield. For example, given its market cap today of $77.89 billion, according to Yahoo! Finance, and using its TTM FCF:\n$5.299 billion TTM FCF / $77.89 billion mkt cap = 0.0.68 =\n6.8% FCF yield\nSo, let's assume that the market would improve this yield slightly to 6.60% (i.e., its potential dividend yield assuming a 100% FCF payout). That would happen if its next 2025 FCF hits $5.5 billion, as management projects (due to its buybacks and improved outlook):\n$5.5 billion FCF est. for 2025 / 0.066 =\n$83.33\nbillion\nmkt cap\nThat implies the market value of FI stock could rise by\n+7.0%\nover its $77.89 billion market cap.\nMoreover, next year, if the FCF hits $5.615 billion (see above) and the FCF yield (i.e., a potential dividend yield) improves to 6.50%:\n$5.615 FCF 2026 est. / 0.065 =\n$86.39 billion\nmtk cap, or +9.5%\nSo, over the next 12 months (NTM) the price target is between +7.0% and +9.5%, or +8.25%. That puts the price target at $154.49:\n$142.72 x 1.0825 =\n$154.49\nHowever, that is not the only way to forecast a price target for FI stock. Let's also look at its historical price/earnings multiples.\nP/E Based Price Target\nFor example, Morningstar reports that the average forward price/earnings (P/E) multiple over the last 5 years has been 17.1x. Seeking Alpha's analysis says it's been 18.71x.\nNow, management at Fiserv has already projected that its 2025 earnings per share (EPS) will be between $10.15 EPS and $10.30, or a growth of +15% to $17% over 2024.\nSo, using a midpoint EPS of $10.23 and a forward P/E of 17.9 (the average of the two surveys):\n$10.23 EPS x 17.91 =\n$183.12\ntarget price\nThat is\n+28.3%\nover today's price. Moreover, next year analysts are projecting EPS of $11.82 according to Seeking Alpha. So, that results in a projected price target of\n$211.5\n8, or +48% upside from here.\nThe bottom line is that FI stock looks very cheap using its historical P/E metrics.\nAnalysts Agree FI Looks Undervalued\nYahoo! Finance's survey of 34 analysts shows an average price target of $187.00, and Barchart's mean survey price is even higher at $206.38.\nThat coincides with AnaChart's price target of $226.04 and Stock Analysis's average of $214.12 from 26 analysts.\nSo, the average survey price target from analysts is\n$208.39\n, or +46% upside from today.\nSummary of Price Targets\nUsing these three methods, you can see that FI stock looks deeply undervalued:\nFCF-Based Target  ………. $154.49\nP/E-Based Target ………… $183.12\nAnalysts' Targets …………. $208.39\nAverage Price Target …….\n$182.00\n, or\n+27.7\n% over $142.50 today.\nBut, for some reason, the stock is falling, and it might make sense to set a lower buy-in target. This can be done by selling short out-of-the-money (OTM) put options. That way, an investor can get paid while waiting to potentially acquire shares.\nShorting OTM Puts\nFor example, the $135 strike price put option for the Aug. 29 expiration period has a midpoint premium of $1.60 per put contract. This strike price is over 5% lower than today's price (i.e., is out-of-the-money) for the next 32 days.\nThat provides an investor who does an order to “Sell to Open” an immediate yield of\n1.18%\n(i.e., $1.60/$135.00).\nFI puts expiring Aug. 29 - Barchart - As of July 28, 2025\nThat means that even if FI stock falls to $135 on or before Aug. 29, the investor's breakeven point is $135-$1.60, or\n$133.40\n. That's -5.39% below today's price and provides good downside protection.\nNote that the risk seems low that the stock will fall this much, as the delta ratio is only 20.66%. Moreover, the potential upside is attractive:\n$182.00 target / $133.40 breakeven = 1.364 =\n+36.4%\nupside\nAnd think about this. If the investor can repeat this play over the next 3 months, the expected return (ER) is\n3.50%\n. That is even if FI stock stays flat or falls less than 5.39% to the breakeven point.\nThe bottom line here is that Fiserv stock looks very cheap. One way to play this and to set a lower buy-in point is to short OTM puts in nearby expiry periods.\nOn the date of publication, Mark R. Hake, CFA did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on\nBarchart.com",
  "read_time": 6
}