{
  "title": "Here's How Much UnitedHealth Group Stock Is Expected to Move After Earnings",
  "link": "https://finance.yahoo.com/news/heres-much-unitedhealth-group-stock-174510648.html",
  "published": "2025-07-28T17:45:10Z",
  "body": "In This Article:\nUNH\nCheng Xin / Getty Images\nUnitedHealth shares have lost more than 40% of their value since the start of this year\nUnitedHealth Group (\nUNH\n) is scheduled to report second-quarter results ahead of the opening bell on Tuesday, with markets expecting the health insurance giant's stock to make a substantial move over the rest of the week.\nBased on recent options pricing, UnitedHealth shares are expected to rise or fall by more than 7% by the end of the week from their recent levels around $283. At the high end, that would be above $303, while at the low end it would be drop below $262, which would surpass May's closing low of $274 and mark the stock's lowest point since early 2020.\nShares sank more than 22% the day of UnitedHealth's\nlast report in April\n, when the insurer slashed its full-year profit projections. In the three quarters before that UnitedHealth stock declined 6% and 8% on the day of its fourth- and third-quarter reports, respectively, and rose 6.5% on the day of\nlast year's second-quarter report\n.\nThe stock has lost more than 40% of its value since the start of the year. It has been dragged lower by the disappointing first-quarter report, a\nsudden CEO departure\nin May, and reports that it is the subject of a Justice Department investigation into its billing practices, which the\ncompany confirmed last week\n.\nAnalysts have stayed bullish on UnitedHealth's stock despite its troubles this year, with 12 of the 15 tracked by Visible Alpha still calling UnitedHealth's stock a buy, along with two holds and one sell rating. The average price target of $379.40 is a premium of more than 30% to the stock's recent levels.\nUnitedHealth is\nexpected to report\na 13% jump in revenue to $111.88 billion, while adjusted earnings per share are projected to drop to $4.64 from $6.80 in the year-ago quarter.\nRead the original article on\nInvestopedia",
  "read_time": 2
}