{
  "title": "Investment firm to pair carrier Koleaseco with Hyway Trucking",
  "link": "https://finance.yahoo.com/news/investment-firm-pair-carrier-koleaseco-185541529.html",
  "published": "2025-07-28T18:55:41Z",
  "body": "Investment firm OneCompass Holdings announced it has entered into an agreement to acquire dryvan and temperature-controlled carrier Koleaseco, Inc.\nFinancial terms of the transaction were not provided. The deal is expected to close on Aug. 22.\nHudsonville, Michigan-based\nKoleaseco\nis listed with 128 power units and 148 drivers, according to the FMCSA’s database. The company also has a full-service brokerage offering for shippers in the U.S. and Canada.\nOneCompass plans to roll the assets of Koleaseco under another one of its portfolio companies, Dublin, Ohio-based\nHyway Transportation\n. Once the deal closes, Koleaseco will operate under the Hyway Trucking banner.\n“We’re excited to welcome the employees and customers of Koleaseco to the OneCompass family and the Hyway Transportation platform, said OneCompass Chairman and CEO Matt Hartman in a news release.\n“Their team and capabilities are a great addition to the Hyway network and will play a key role in speeding up our shared vision for national growth. We’re especially pleased to integrate their people into our employee ownership model, where they can help shape the future and share in the success they contribute to.”\nThe combination will allow both fleets to better compete on a national scale.\nHyway is also an asset-based carrier that specializes in dryvan and temperature-controlled freight. It is listed with 130 power units. Hyway is a subsidiary of\nFST Logistics\n, another OneCompass portfolio company.\n“I’m confident this transition will create meaningful opportunities for our team and carry forward the legacy of service and integrity that has defined Koleaseco for more than 30 years,” said JP Koop, owner of Koleaseco.\nMore FreightWaves articles by Todd Maiden:\nLosses mount at Pamt, TL unit posts 112.5% OR\nSaia beginning to shake off growing pains\nHeartland Express books another loss in Q2\nThe post\nInvestment firm to pair carrier Koleaseco with Hyway Trucking\nappeared first on\nFreightWaves\n.",
  "read_time": 2
}