{
  "title": "Skechers Calls Kizik’s Hands-Free Slip-On Patent Lawsuit ‘Baseless’ as Legal Battle Heats Up",
  "link": "https://finance.yahoo.com/news/skechers-calls-kizik-hands-free-172522957.html",
  "published": "2025-07-28T17:25:22Z",
  "body": "Skechers has responded to Kizik’s claims that it allegedly knocked-off several of its patented hands-free slip-on footwear designs.\nIn a statement issued on Monday,\nSkechers\ncalled\nKizik\n’s allegations “baseless,” and said they are “based on the assertion that Kizik created the hands-free footwear category and is the only company that can legally use that century-old idea.”\nMore from WWD\nKizik Parent Sues Skechers for Allegedly Knocking Off Hands-Free Slip-On Shoe Tech\nSkechers Secures Legal Win to Move Forward on Acquisition\nSkechers Signs WNBA Star Jackie Young, Expands Basketball Lineup With Custom SKX Nexus Sneakers\nThe Manhattan Beach, Calif.-based footwear company added that “contrary to Kizik’s false assertion that Skechers patents have been rejected, Skechers has developed its own unique Slip-ins technology and has obtained more than 140 utility and design patents worldwide, including in the United States, and has vigilantly enforced its patent rights, resulting in numerous judgements, injunctions and settlements around the world.”\nMichael Greenberg\n, president of Skechers, stated on Monday that the “timing of this lawsuit is curious,” pointing to the new $9.42 billion go-private\ndeal with 3G Capital\n.\n“Kizik asserts that, ‘at the heart of Skechers’ hands-free shoes’ are Kizik’s patented technologies, yet Skechers has been advertising and selling its Slip-ins since December 2021 without so much as a letter from Kizik,” Greenberg said. “Then, after the merger is announced, Kizik hires a law firm also used by Nike and attacks our whole Slip-ins product line. We believe that, after all these years of silence, the true motivation for this lawsuit might be found right on the face of Kizik’s complaint, where they state that they are looking for a share of the $9.42 billion being paid for Skechers, money Kizik did not earn and does not deserve.”\nThe footwear executive added that the company will “aggressively challenge” both the validity of the patents and the infringement claims.\nWhen reached by FN on Monday,\nGareth Hosford\n, chief executive officer of HandsFree Labs, said that the company is “confident” in the strength of its claims outlined in the complaint filed on July 24.\n“Our patents are valid, Skechers’ infringement is evident, and the facts speak for themselves,” Hosford stated. “We look forward to conducting discovery and bringing our case before a jury.”\nThe company’s\nlawsuit\nagainst Skechers, filed last Thursday, alleges that the company “knowingly and willfully infringed” four HandsFree Labs utility patents, which protect core mechanical innovations that enable true hands-free shoe entry, as well as two HandsFree Labs design patents, which protect ornamental innovations.\nStory Continues\nBest of WWD\nAll the Retailers That Nike Left and Then Went Back\nMikey Madison's Elegant Red Carpet Shoe Style [PHOTOS]\nJulia Fox's Sleekest and Boldest Shoe Looks Over the Years [Photos]\nSign up for\nFN's Newsletter\n. For the latest news, follow us on\nFacebook\n,\nTwitter\n, and\nInstagram\n.",
  "read_time": 2
}