{
  "title": "Soybean Bulls Tripping Up on Monday",
  "link": "https://finance.yahoo.com/news/soybean-bulls-tripping-monday-171835805.html",
  "published": "2025-07-28T17:18:35Z",
  "body": "In This Article:\nZS=F\nSoybeans emerging in the spring by jcesar2015 via Pixabay\nSoybeans are down 9 to 10 cents across the front months on Monday. The cmdtyView national average new crop Cash Bean price is down 9 1/4 cents at $9.60 1/2. Soymeal futures are fading lower, with contracts $1.90 to $2.10. Soy Oil was is 2 to 6 points higher at midday.\nThis morning’s Export Inspections report showed a total of 409,714 (15.05 mbu) of soybeans shipped in the week of 7/24. That is up 8.7% from last week and 0.3% above the same week in 2024. Egypt was the top destination of 154,434 MT, with 75,603 MT headed to Netherlands and 72,432 MT to Mexico. Marketing year shipments are now at 47.2 MMT (1.734 bbu), which is 10.4% above the same period last year.\nMore News from Barchart\nDoes the 2025 Corn Crop Have a Pollination Problem?\nWeather Shocks vs. Oversupply: Are You Trading SRW Wheat's Next Big Move?\nAdverse Brazilian Weather and Tariff Concerns Boost Coffee Prices\nMarkets move fast. Keep up by reading our FREE midday Barchart Brief newsletter for exclusive charts, analysis, and headlines.\nThe US and EU announced the framework for a trade agreement over the weekend, which includes 15% US tariffs on most EU goods, $750 billion in US energy purchases over 3 years, and EU lowering some tariffs on US ag goods. Nothing is official, nor has much been announced in relation to ag. The US and China are also expected to extend the pause on increased tariffs for another 90 days, as the two countries meeting is expected to resume today in Sweden.\nWeekly Commitment of Traders data indicated a total of 21,412 contracts were cut from the managed money net short position in soybean futures and options as of July 22. That took their net position to 10,886 contracts by Tuesday.\nOver the weekend, President Milei of Argentina announced a reduction in the export tax on soybeans back to 26%, from 33%, with meal and oil dropping from 31% to 24.5%.\nAug 25 Soybeans  are at $9.88 1/2, down 10 1/4 cents,\nNearby Cash  is at $9.55 1/4, down 10 cents,\nSep 25 Soybeans  are at $9.92, down 10 cents,\nNov 25 Soybeans  are at $10.11 1/4, down 9 3/4 cents,\nNew Crop Cash  is at $9.60 1/2, down 9 1/4 cents,\nOn the date of publication, Austin Schroeder did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on\nBarchart.com",
  "read_time": 2
}