{
  "title": "Strength in Crude Oil Sparks Short Covering in Sugar Futures",
  "link": "https://finance.yahoo.com/news/strength-crude-oil-sparks-short-182338234.html",
  "published": "2025-07-28T18:23:38Z",
  "body": "In This Article:\nSB=F\nCL=F\nGlass jar and bowl with white sugar cubes on table by Liudmila Chernetska via iStock\nOctober NY world sugar #11 (SBV25) on Monday closed up +0.14 (+0.86%), and October London ICE white sugar #5 (SWV25) closed up +3.80 (+0.81%).\nSugar prices finished higher Monday as a rally in crude oil prices sparked short covering in sugar futures.  WTI crude oil (CLU5) rose by more than +2% Monday to a 1-week high, which benefits ethanol prices and may prompt the world's sugar mills to divert cane crushing toward ethanol production rather than sugar, thus curbing sugar supplies.\nMore News from Barchart\nDoes the 2025 Corn Crop Have a Pollination Problem?\nWeather Shocks vs. Oversupply: Are You Trading SRW Wheat's Next Big Move?\nAdverse Brazilian Weather and Tariff Concerns Boost Coffee Prices\nStop Missing Market Moves: Get the FREE Barchart Brief – your midday dose of stock movers, trending sectors, and actionable trade ideas, delivered right to your inbox. Sign Up Now!\nLast Wednesday, sugar prices fell to 3-week lows after Bloomberg reported that India may permit local sugar mills to export sugar in the next season, which starts in October, as abundant monsoon rains may produce a bumper sugar crop.  India's Meteorological Department reported Monday that cumulative monsoon rain in India is 6% above normal as of July 21.\nThe outlook for higher sugar production in Brazil is bearish for sugar prices.  Datagro said Monday that dry weather in Brazil has encouraged the country's sugar mills to increase their cane crushing, diverting more of the cane crush toward more profitable sugar production rather than ethanol.  According to Covrig, Brazil's sugar mills are expected to crush 54% of the available cane in the first half of this month, likely adding 3.2 MMT of sugar into the market.\nThe outlook for higher sugar production in India, the world's second-largest producer, is bearish for prices.  On June 2, India's National Federation of Cooperative Sugar Factories projected that India's 2025/26 sugar production would climb +19% y/y to 35 MMT, citing larger planted cane acreage.  That would follow a -17.5% y/y decline in India's sugar production in 2024/25 to a 5-year low of 26.2 MMT, according to the Indian Sugar Mills Association (ISMA).  Also, the ISMA reported on July 7 that India's sugar production during Oct 1-May 15 fell -17% y/y to 25.74 MMT.\nSugar prices have retreated over the past three months, with NY sugar falling to a 4.25-year low earlier this month and London sugar sliding to a nearly 4-year low, driven by expectations of a sugar surplus in the 2025/26 season.  On June 30, commodities trader Czarnikow projected a 7.5 MMT global sugar surplus for the 2025/26 season, the largest surplus in 8 years.  On May 22, the USDA, in its biannual report, projected that global 2025/26 sugar production would increase by +4.7% y/y to a record 189.318 MMT, with global sugar ending stocks at 41.188 MMT, up 7.5% y/y.\nStory Continues\nSigns that the recent slide in sugar prices to 4-year lows has sparked a pickup in demand are positive for sugar prices.  China's June sugar imports soared by 1,435% to 420,000 MT.  Also, President Trump last Wednesday said Coca-Cola agreed to use cane sugar in Coke beverages sold in the US instead of high-fructose corn syrup, which could boost US sugar consumption by +4.4% to 11.5 MMT from 11 MMT currently, according to Bloomberg Intelligence.\nSugar prices also have support from reduced sugar production in Brazil.  Unica reported last Monday that the cumulative 2025/26 Brazil Center-South sugar output through June fell by -14.3% y/y to 12.249 MMT.  Last month, Conab, Brazil's government crop forecasting agency, said 2024/25 Brazil sugar production fell by -3.4% y/y to 44.118 MMT, citing lower sugarcane yields due to drought and excessive heat.\nThe outlook for higher sugar production in Thailand is bearish for sugar prices.  On May 2, Thailand's Office of the Cane and Sugar Board reported that Thailand's 2024/25 sugar production rose +14% y/y to 10.00 MMT.  Thailand is the world's third-largest sugar producer and the second-largest exporter of sugar.\nThe International Sugar Organization (ISO) raised its 2024/25 global sugar deficit forecast to a 9-year high of -5.47 MMT on May 15, up from a February forecast of -4.88 MMT.  This indicates a tightening market following the 2023/24 global sugar surplus of 1.31 MMT.  ISO also cut its 2024/25 global sugar production forecast to 174.8 MMT from a February forecast of 175.5 MMT.\nThe USDA, in its bi-annual report released May 22, projected that global 2025/26 sugar production would climb +4.7% y/y to a record 189.318 MMT and that global 2025/26 human sugar consumption would increase +1.4% y/y to a record 177.921 MMT.  The USDA also forecasted that 2025/26 global sugar ending stocks would climb +7.5% y/y to 41.188 MMT.  The USDA's Foreign Agricultural Service (FAS) predicted that Brazil's 2025/26 sugar production would rise +2.3% y/y to a record 44.7 MMT  FAS predicted that India's 2025/26 sugar production would rise +25% y/y to 35.3 MMT due to favorable monsoon rains and increased sugar acreage.  FAS predicted that Thailand's 2025/26 sugar production will climb +2% y/y to 10.3 MMT.\nOn the date of publication, Rich Asplund did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on\nBarchart.com",
  "read_time": 4
}