{
  "title": "This Highly Shorted Stock Is Surging. Should You Buy the Squeeze?",
  "link": "https://finance.yahoo.com/news/highly-shorted-stock-surging-buy-185454561.html",
  "published": "2025-07-28T18:54:54Z",
  "body": "Bullish - green stock market chart with arrow up day trade by Quality Stock Arts via Shutterstock\nStem (STEM) shares rallied more than 25% on Monday as investors ran into the AI-driven clean energy solutions company amid growing speculation of a short squeeze.\nWith a short interest exceeding 18% of the float, a continued rally in STEM shares in recent weeks has caught many bearish investors off guard, forcing some to cover positions, further adding fuel to the upside.\nMore News from Barchart\nWarren Buffett Warns Inflation Turns Business Into ‘The Upside-Down World of Alice in Wonderland’ But Weeds Out ‘Bad Businesses’\nWhy GOOGL Stock May Be the Market’s Next Big Winner\nAlphabet Posts Lower Free Cash Flow and FCF Margins - Is GOOGL Stock Overvalued?\nOur exclusive Barchart Brief newsletter is your FREE midday guide to what's moving stocks, sectors, and investor sentiment - delivered right when you need the info most. Subscribe today!\nIncluding today’s surge, Stem stock is up over 200% versus its low set in the final week of June.\nWhy Stem Stock May Be Worth Buying Here\nDespite an explosive move to the upside over the past four weeks, STEM stock may still be worth owning as the short squeeze could escalate further in the days ahead.\nThe Houston-headquartered firm currently has more than 18% of its float sold.\nTherefore, any sustained upward momentum could force short sellers to buy back shares, driving prices even higher from current levels.\nMoreover, the recent rally has pushed Stem shares well above all of their major moving averages, presenting somewhat of a compelling technical case to own them as well.\nwww.barchart.com\nHere’s the Case Against Owning STEM Shares\nFor serious, long-term investors, however, STEM shares remain a high-risk proposition given the company’s fundamentals remain rather thin.\nThe NYSE-listed firm continues to record significant losses, with over $800 million reported as of December 2024.\nMoreover, the recent reverse stock split and dilution through convertible notes raise concerns about shareholder value as well.\nStem stock investors should, therefore, practice caution as short squeezes, while often lucrative, tend to be short-lived as they’re driven by emotion, not fundamentals. Therefore, once the hype fades, STEM stock could retrace just as quickly, leaving late buyers exposed to steep losses.\nHow Wall Street Recommends Playing Stem\nInvestors should prefer staying on the sidelines in STEM shares amidst the ongoing short squeeze also because Wall Street doesn’t currently view them favorably for the back half of 2025.\nAccording to Barchart, the consensus rating on Stem stock currently sits at “Hold” only with the mean target of about $11 indicating potential downside of roughly 40% from here.\nStory continues\nwww.barchart.com\nOn the date of publication, Wajeeh Khan did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on\nBarchart.com",
  "read_time": 2
}