{
  "title": "What Analysts Think of Amazon Stock Ahead of Earnings",
  "link": "https://finance.yahoo.com/news/analysts-think-amazon-stock-ahead-174440681.html",
  "published": "2025-07-28T17:44:40Z",
  "body": "In This Article:\nAMZN\nKlaus Galiano / Bloomberg / Getty Images\nAmazon held its longest-ever Prime Day sales event earlier this month\nKey Takeaways\nAmazon is set to post second-quarter results after the closing bell Thursday.\nThe e-commerce and cloud computing giant is expected to report rising sales and profits.\nSeveral analysts have recently raised their price targets, and said they expect Amazon Web Services revenue growth to accelerate over the second half of this year.\nAmazon (\nAMZN\n) is scheduled to report second-quarter earnings after the market closes on Thursday, with analysts overwhelmingly bullish on the online retail and cloud services giant's stock.\nAll 25 analysts tracked by Visible Alpha give Amazon's stock a \"buy\" or equivalent rating. Their average price target at $249 would surpass Amazon's previous record close of $242.06 on Feb. 4. The stock has added about 6% this year so far, at just above $233 in recent trading.\nAmazon is expected to report a nearly 10% bump in revenue to $162.18 billion, while earnings per share are projected to increase to $1.33 from $1.26 the same time a year ago.\nLast quarter\n, Amazon topped estimates even as\nanalysts had raised concerns\nthat tariffs could impact consumers' shopping behavior. But the earnings beat was offset by weaker-than-expected operating income forecasts. Consumers didn't\nappear to have issues\nwith prices during Amazon's\nlongest-ever\nfour-day\nPrime Day sales event\nearlier this month, which brought record sales. The Prime Day sales will be part of Amazon's third-quarter results.\nSeveral Analysts Recently Lifted Price Targets\nDeutsche Bank analysts, lifting their price target to $266 from $230, wrote recently that they believe \"a resilient consumer backdrop and tariff-related cost increases that continue to get kicked down the road should support upside to 2Q/3Q numbers.\" They also said that Amazon appears to be gaining e-commerce market share as tariffs and the Trump administration's\nclosing of the de minimis\nimport exemption have led U.S. shoppers to turn away from low-cost\nChinese platforms like Temu\n.\nBank of America analysts recently bumped their price target to $265 from $248, writing that they expect Amazon's retail sales to top estimates. While they said\nAmazon Web Services\n' revenue growth could slow from the first quarter, they believe it should accelerate again in the second half of the year due to \"strong AI demand and AWS capacity growth.\"\nAnalysts at HSBC and Citi also raised their targets recently to $256 and $265, respectively, from $240 and $225. HSBC analysts called Amazon well-positioned to navigate tariff uncertainty. Citi analysts, meanwhile, said they will be looking for commentary on the scaling of AWS infrastructure that would accelerate the cloud service's growth this year.\nRead the original article on\nInvestopedia",
  "read_time": 2
}